{battle_pass = --{{{
{	
	--{{{
	Reward = {		
		--{{{
		[1] = {			
			--{{{
			Count = 1,
			Item = 845,
			ID = 1,
			--}}}
			},
		[2] = {			
			--{{{
			Count = 1,
			Item = 846,
			ID = 2,
			--}}}
			},
		[3] = {			
			--{{{
			Count = 1,
			Item = 1055,
			ID = 3,
			--}}}
			},
		[4] = {			
			--{{{
			Count = 1,
			Item = 1056,
			ID = 4,
			--}}}
			},
		[5] = {			
			--{{{
			Count = 30,
			Item = 10000,
			ID = 5,
			--}}}
			},
		[6] = {			
			--{{{
			Count = 1,
			Item = 10010,
			ID = 6,
			--}}}
			},
		[7] = {			
			--{{{
			Count = 1,
			Item = 10011,
			ID = 7,
			--}}}
			},
		[8] = {			
			--{{{
			Count = 1,
			Item = 10012,
			ID = 8,
			--}}}
			},
		[9] = {			
			--{{{
			Count = 1,
			Item = 12831,
			ID = 9,
			--}}}
			},
		[10] = {			
			--{{{
			Count = 1,
			Item = 12833,
			ID = 10,
			--}}}
			},
		[11] = {			
			--{{{
			Count = 1,
			Item = 12834,
			ID = 11,
			--}}}
			},
		[12] = {			
			--{{{
			Count = 1,
			Item = 12948,
			ID = 12,
			--}}}
			},
		[13] = {			
			--{{{
			Count = 1,
			Item = 12961,
			ID = 13,
			--}}}
			},
		[14] = {			
			--{{{
			Count = 1,
			Item = 12962,
			ID = 14,
			--}}}
			},
		[15] = {			
			--{{{
			Count = 1,
			Item = 12964,
			ID = 15,
			--}}}
			},
		[16] = {			
			--{{{
			Count = 1,
			Item = 12988,
			ID = 16,
			--}}}
			},
		[17] = {			
			--{{{
			Count = 1,
			Item = 20266,
			ID = 17,
			--}}}
			},
		[18] = {			
			--{{{
			Count = 1,
			Item = 20267,
			ID = 18,
			--}}}
			},
		[19] = {			
			--{{{
			Count = 1,
			Item = 20467,
			ID = 19,
			--}}}
			},
		[20] = {			
			--{{{
			Count = 1,
			Item = 20922,
			ID = 20,
			--}}}
			},
		[21] = {			
			--{{{
			Count = 1,
			Item = 20971,
			ID = 21,
			--}}}
			},
		[22] = {			
			--{{{
			Count = 1,
			Item = 22379,
			ID = 22,
			--}}}
			},
		[23] = {			
			--{{{
			Count = 1,
			Item = 22380,
			ID = 23,
			--}}}
			},
		[24] = {			
			--{{{
			Count = 1,
			Item = 22381,
			ID = 24,
			--}}}
			},
		[25] = {			
			--{{{
			Count = 1,
			Item = 22382,
			ID = 25,
			--}}}
			},
		[26] = {			
			--{{{
			Count = 1,
			Item = 22383,
			ID = 26,
			--}}}
			},
		[27] = {			
			--{{{
			Count = 1,
			Item = 20032,
			ID = 27,
			--}}}
			},
		[28] = {			
			--{{{
			Count = 30,
			Item = 10002,
			ID = 28,
			--}}}
			},
		[29] = {			
			--{{{
			Count = 60,
			Item = 10002,
			ID = 29,
			--}}}
			},
		[30] = {			
			--{{{
			Count = 1,
			Item = 21378,
			ID = 30,
			--}}}
			},
		[31] = {			
			--{{{
			Count = 1,
			Item = 12834,
			ID = 31,
			--}}}
			},
		[32] = {			
			--{{{
			Count = 1,
			Item = 12833,
			ID = 32,
			--}}}
			},
		[33] = {			
			--{{{
			Count = 1,
			Item = 12988,
			ID = 33,
			--}}}
			},
		[34] = {			
			--{{{
			Count = 1,
			Item = 12831,
			ID = 34,
			--}}}
			},
		[35] = {			
			--{{{
			Count = 1,
			Item = 49005,
			ID = 35,
			--}}}
			},
		[36] = {			
			--{{{
			Count = 1,
			Item = 12962,
			ID = 36,
			--}}}
			},
		[37] = {			
			--{{{
			Count = 1,
			Item = 12948,
			ID = 37,
			--}}}
			},
		[38] = {			
			--{{{
			Count = 1,
			Item = 12961,
			ID = 38,
			--}}}
			},
		[39] = {			
			--{{{
			Count = 1,
			Item = 12964,
			ID = 39,
			--}}}
			},
		[40] = {			
			--{{{
			Count = 1,
			Item = 21380,
			ID = 40,
			--}}}
			},
		[41] = {			
			--{{{
			Count = 1,
			Item = 21382,
			ID = 41,
			--}}}
			},
		[42] = {			
			--{{{
			Count = 1,
			Item = 1055,
			ID = 42,
			--}}}
			},
		[43] = {			
			--{{{
			Count = 1,
			Item = 845,
			ID = 43,
			--}}}
			},
		[44] = {			
			--{{{
			Count = 1,
			Item = 1056,
			ID = 44,
			--}}}
			},
		[45] = {			
			--{{{
			Count = 1,
			Item = 10011,
			ID = 45,
			--}}}
			},
		[46] = {			
			--{{{
			Count = 1,
			Item = 20291,
			ID = 46,
			--}}}
			},
		[47] = {			
			--{{{
			Count = 1,
			Item = 20290,
			ID = 47,
			--}}}
			},
		[48] = {			
			--{{{
			Count = 1,
			Item = 21990,
			ID = 48,
			--}}}
			},
		[49] = {			
			--{{{
			Count = 30,
			Item = 10000,
			ID = 49,
			--}}}
			},
		[50] = {			
			--{{{
			Count = 10,
			Item = 10002,
			ID = 50,
			--}}}
			},
		[51] = {			
			--{{{
			Count = 1,
			Item = 22136,
			ID = 51,
			--}}}
			},
		[52] = {			
			--{{{
			Count = 1,
			Item = 20493,
			ID = 52,
			--}}}
			},
		[53] = {			
			--{{{
			Count = 30,
			Item = 10002,
			ID = 53,
			--}}}
			},
		[54] = {			
			--{{{
			Count = 1,
			Item = 10010,
			ID = 54,
			--}}}
			},
		[55] = {			
			--{{{
			Count = 1,
			Item = 22361,
			ID = 55,
			--}}}
			},
		[56] = {			
			--{{{
			Count = 1,
			Item = 10012,
			ID = 56,
			--}}}
			},
		[57] = {			
			--{{{
			Count = 40,
			Item = 10002,
			ID = 57,
			--}}}
			},
		[58] = {			
			--{{{
			Count = 50,
			Item = 10002,
			ID = 58,
			--}}}
			},
		[59] = {			
			--{{{
			Count = 1,
			Item = 20488,
			ID = 59,
			--}}}
			},
		[60] = {			
			--{{{
			Count = 20,
			Item = 10002,
			ID = 60,
			--}}}
			},
		[61] = {			
			--{{{
			Count = 1,
			Item = 12856,
			ID = 61,
			--}}}
			},
		--}}}
		},
	Level = {		
		--{{{
		[1] = {			
			--{{{
			PayMinicoin = 0,
			RequireIntegral = 0,
			Level = 1,
			ID = 1,
			--}}}
			},
		[2] = {			
			--{{{
			PayMinicoin = 25,
			RequireIntegral = 300,
			Level = 2,
			ID = 2,
			--}}}
			},
		[3] = {			
			--{{{
			PayMinicoin = 50,
			RequireIntegral = 600,
			Level = 3,
			ID = 3,
			--}}}
			},
		[4] = {			
			--{{{
			PayMinicoin = 75,
			RequireIntegral = 900,
			Level = 4,
			ID = 4,
			--}}}
			},
		[5] = {			
			--{{{
			PayMinicoin = 100,
			RequireIntegral = 1200,
			Level = 5,
			ID = 5,
			--}}}
			},
		[6] = {			
			--{{{
			PayMinicoin = 125,
			RequireIntegral = 1500,
			Level = 6,
			ID = 6,
			--}}}
			},
		[7] = {			
			--{{{
			PayMinicoin = 150,
			RequireIntegral = 1800,
			Level = 7,
			ID = 7,
			--}}}
			},
		[8] = {			
			--{{{
			PayMinicoin = 175,
			RequireIntegral = 2100,
			Level = 8,
			ID = 8,
			--}}}
			},
		[9] = {			
			--{{{
			PayMinicoin = 200,
			RequireIntegral = 2400,
			Level = 9,
			ID = 9,
			--}}}
			},
		[10] = {			
			--{{{
			PayMinicoin = 225,
			RequireIntegral = 2700,
			Level = 10,
			ID = 10,
			--}}}
			},
		[11] = {			
			--{{{
			PayMinicoin = 250,
			RequireIntegral = 3000,
			Level = 11,
			ID = 11,
			--}}}
			},
		[12] = {			
			--{{{
			PayMinicoin = 275,
			RequireIntegral = 3300,
			Level = 12,
			ID = 12,
			--}}}
			},
		[13] = {			
			--{{{
			PayMinicoin = 300,
			RequireIntegral = 3600,
			Level = 13,
			ID = 13,
			--}}}
			},
		[14] = {			
			--{{{
			PayMinicoin = 325,
			RequireIntegral = 3900,
			Level = 14,
			ID = 14,
			--}}}
			},
		[15] = {			
			--{{{
			PayMinicoin = 350,
			RequireIntegral = 4200,
			Level = 15,
			ID = 15,
			--}}}
			},
		[16] = {			
			--{{{
			PayMinicoin = 375,
			RequireIntegral = 4500,
			Level = 16,
			ID = 16,
			--}}}
			},
		[17] = {			
			--{{{
			PayMinicoin = 400,
			RequireIntegral = 4800,
			Level = 17,
			ID = 17,
			--}}}
			},
		[18] = {			
			--{{{
			PayMinicoin = 425,
			RequireIntegral = 5100,
			Level = 18,
			ID = 18,
			--}}}
			},
		[19] = {			
			--{{{
			PayMinicoin = 450,
			RequireIntegral = 5400,
			Level = 19,
			ID = 19,
			--}}}
			},
		[20] = {			
			--{{{
			PayMinicoin = 475,
			RequireIntegral = 5700,
			Level = 20,
			ID = 20,
			--}}}
			},
		[21] = {			
			--{{{
			PayMinicoin = 500,
			RequireIntegral = 6000,
			Level = 21,
			ID = 21,
			--}}}
			},
		[22] = {			
			--{{{
			PayMinicoin = 525,
			RequireIntegral = 6300,
			Level = 22,
			ID = 22,
			--}}}
			},
		[23] = {			
			--{{{
			PayMinicoin = 550,
			RequireIntegral = 6600,
			Level = 23,
			ID = 23,
			--}}}
			},
		[24] = {			
			--{{{
			PayMinicoin = 575,
			RequireIntegral = 6900,
			Level = 24,
			ID = 24,
			--}}}
			},
		[25] = {			
			--{{{
			PayMinicoin = 600,
			RequireIntegral = 7200,
			Level = 25,
			ID = 25,
			--}}}
			},
		[26] = {			
			--{{{
			PayMinicoin = 625,
			RequireIntegral = 7500,
			Level = 26,
			ID = 26,
			--}}}
			},
		[27] = {			
			--{{{
			PayMinicoin = 650,
			RequireIntegral = 7800,
			Level = 27,
			ID = 27,
			--}}}
			},
		[28] = {			
			--{{{
			PayMinicoin = 675,
			RequireIntegral = 8100,
			Level = 28,
			ID = 28,
			--}}}
			},
		[29] = {			
			--{{{
			PayMinicoin = 700,
			RequireIntegral = 8400,
			Level = 29,
			ID = 29,
			--}}}
			},
		[30] = {			
			--{{{
			PayMinicoin = 725,
			RequireIntegral = 8700,
			Level = 30,
			ID = 30,
			--}}}
			},
		[31] = {			
			--{{{
			PayMinicoin = 750,
			RequireIntegral = 9000,
			Level = 31,
			ID = 31,
			--}}}
			},
		[32] = {			
			--{{{
			PayMinicoin = 775,
			RequireIntegral = 9300,
			Level = 32,
			ID = 32,
			--}}}
			},
		[33] = {			
			--{{{
			PayMinicoin = 800,
			RequireIntegral = 9600,
			Level = 33,
			ID = 33,
			--}}}
			},
		[34] = {			
			--{{{
			PayMinicoin = 825,
			RequireIntegral = 9900,
			Level = 34,
			ID = 34,
			--}}}
			},
		[35] = {			
			--{{{
			PayMinicoin = 850,
			RequireIntegral = 10200,
			Level = 35,
			ID = 35,
			--}}}
			},
		[36] = {			
			--{{{
			PayMinicoin = 875,
			RequireIntegral = 10500,
			Level = 36,
			ID = 36,
			--}}}
			},
		[37] = {			
			--{{{
			PayMinicoin = 900,
			RequireIntegral = 10800,
			Level = 37,
			ID = 37,
			--}}}
			},
		[38] = {			
			--{{{
			PayMinicoin = 925,
			RequireIntegral = 11100,
			Level = 38,
			ID = 38,
			--}}}
			},
		[39] = {			
			--{{{
			PayMinicoin = 950,
			RequireIntegral = 11400,
			Level = 39,
			ID = 39,
			--}}}
			},
		[40] = {			
			--{{{
			PayMinicoin = 975,
			RequireIntegral = 11700,
			Level = 40,
			ID = 40,
			--}}}
			},
		[41] = {			
			--{{{
			PayMinicoin = 1000,
			RequireIntegral = 12000,
			Level = 41,
			ID = 41,
			--}}}
			},
		[42] = {			
			--{{{
			PayMinicoin = 1025,
			RequireIntegral = 12300,
			Level = 42,
			ID = 42,
			--}}}
			},
		[43] = {			
			--{{{
			PayMinicoin = 1050,
			RequireIntegral = 12600,
			Level = 43,
			ID = 43,
			--}}}
			},
		[44] = {			
			--{{{
			PayMinicoin = 1075,
			RequireIntegral = 12900,
			Level = 44,
			ID = 44,
			--}}}
			},
		[45] = {			
			--{{{
			PayMinicoin = 1100,
			RequireIntegral = 13200,
			Level = 45,
			ID = 45,
			--}}}
			},
		--}}}
		},
	Draw = {		
		--{{{
		[1] = {			
			--{{{
			Type = {				
				--{{{
				[1] = 0,
				[2] = 12,
				--}}}
				},
			Item1 = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 20467,
					[2] = 1,
					[3] = 10000,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 22383,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[3] = {					
					--{{{
					[1] = 22382,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[4] = {					
					--{{{
					[1] = 22381,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[5] = {					
					--{{{
					[1] = 22380,
					[2] = 1,
					[3] = 50000,
					--}}}
					},
				[6] = {					
					--{{{
					[1] = 22379,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[7] = {					
					--{{{
					[1] = 20564,
					[2] = 1,
					[3] = 1000000,
					--}}}
					},
				[8] = {					
					--{{{
					[1] = 21382,
					[2] = 1,
					[3] = 1300000,
					--}}}
					},
				[9] = {					
					--{{{
					[1] = 49005,
					[2] = 1,
					[3] = 1500000,
					--}}}
					},
				[10] = {					
					--{{{
					[1] = 12964,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[11] = {					
					--{{{
					[1] = 12831,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[12] = {					
					--{{{
					[1] = 12961,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				--}}}
				},
			CertainlyReward = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 0,
					--}}}
					},
				--}}}
				},
			TimePrice = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 1,
					[2] = 20,
					[3] = 6,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 5,
					[2] = 100,
					[3] = 6,
					--}}}
					},
				--}}}
				},
			Name = "普通抽奖盘",
			ID = 1,
			--}}}
			},
		[2] = {			
			--{{{
			Type = {				
				--{{{
				[1] = 1,
				[2] = 13,
				--}}}
				},
			Item1 = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 20467,
					[2] = 1,
					[3] = 10000,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 22383,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[3] = {					
					--{{{
					[1] = 22382,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[4] = {					
					--{{{
					[1] = 22381,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[5] = {					
					--{{{
					[1] = 22380,
					[2] = 1,
					[3] = 50000,
					--}}}
					},
				[6] = {					
					--{{{
					[1] = 22379,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[7] = {					
					--{{{
					[1] = 20564,
					[2] = 1,
					[3] = 1000000,
					--}}}
					},
				[8] = {					
					--{{{
					[1] = 21382,
					[2] = 1,
					[3] = 1300000,
					--}}}
					},
				[9] = {					
					--{{{
					[1] = 49005,
					[2] = 1,
					[3] = 1500000,
					--}}}
					},
				[10] = {					
					--{{{
					[1] = 12964,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[11] = {					
					--{{{
					[1] = 12831,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[12] = {					
					--{{{
					[1] = 12961,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				--}}}
				},
			CertainlyReward = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 0,
					--}}}
					},
				--}}}
				},
			TimePrice = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 1,
					[2] = 20,
					[3] = 6,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 5,
					[2] = 100,
					[3] = 6,
					--}}}
					},
				--}}}
				},
			Name = "白卡抽奖盘",
			ID = 2,
			--}}}
			},
		[3] = {			
			--{{{
			Type = {				
				--{{{
				[1] = 2,
				[2] = 14,
				--}}}
				},
			Item1 = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 20467,
					[2] = 1,
					[3] = 10000,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 22383,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[3] = {					
					--{{{
					[1] = 22382,
					[2] = 1,
					[3] = 30000,
					--}}}
					},
				[4] = {					
					--{{{
					[1] = 22381,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[5] = {					
					--{{{
					[1] = 22380,
					[2] = 1,
					[3] = 50000,
					--}}}
					},
				[6] = {					
					--{{{
					[1] = 22379,
					[2] = 1,
					[3] = 40000,
					--}}}
					},
				[7] = {					
					--{{{
					[1] = 20564,
					[2] = 1,
					[3] = 1000000,
					--}}}
					},
				[8] = {					
					--{{{
					[1] = 21382,
					[2] = 1,
					[3] = 1300000,
					--}}}
					},
				[9] = {					
					--{{{
					[1] = 49005,
					[2] = 1,
					[3] = 1500000,
					--}}}
					},
				[10] = {					
					--{{{
					[1] = 12964,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[11] = {					
					--{{{
					[1] = 12831,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				[12] = {					
					--{{{
					[1] = 12961,
					[2] = 1,
					[3] = 2000000,
					--}}}
					},
				--}}}
				},
			CertainlyReward = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 0,
					--}}}
					},
				--}}}
				},
			TimePrice = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 1,
					[2] = 20,
					[3] = 6,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 5,
					[2] = 100,
					[3] = 6,
					--}}}
					},
				--}}}
				},
			Name = "金卡抽奖盘",
			ID = 3,
			--}}}
			},
		--}}}
		},
	ChallengeMission = {		
		--{{{
		[1] = {			
			--{{{
			Des = "击杀羽蛇神1次",
			Integral = 500,
			Jump = 310,
			ID = 1001,
			Trigger = 1,
			Icon = 16,
			Content = 70301,
			Condition = 1,
			Event = "killsnakegod",
			--}}}
			},
		[2] = {			
			--{{{
			Des = "家园宠物探险10次",
			Integral = 300,
			Jump = 312,
			ID = 1002,
			Trigger = 1,
			Icon = 13,
			Content = 70302,
			Condition = 10,
			Event = "pet_explore",
			--}}}
			},
		[3] = {			
			--{{{
			Des = "玩10局对战模式并取得胜利",
			Integral = 500,
			Jump = 11,
			ID = 1003,
			Trigger = 1,
			Icon = 10,
			Content = 70303,
			Condition = 10,
			Event = "play_battle_win",
			--}}}
			},
		[4] = {			
			--{{{
			Des = "给地图投块10次",
			Integral = 300,
			Jump = 15,
			ID = 1004,
			Trigger = 1,
			Icon = 12,
			Content = 70304,
			Condition = 10,
			Event = "deliver_chunk",
			--}}}
			},
		[5] = {			
			--{{{
			Des = "小果实抽奖10次",
			Integral = 200,
			Jump = 6,
			ID = 1005,
			Trigger = 1,
			Icon = 15,
			Content = 70305,
			Condition = 10,
			Event = "littlefruit_roll",
			--}}}
			},
		--}}}
		},
	Mission = {		
		--{{{
		[1] = {			
			--{{{
			Des = "登录1次",
			Times = 1,
			Content = 70040,
			ID = 1,
			Jump = 0,
			Integral = 12,
			Title = 70023,
			Type = 2,
			Icon = 1,
			hard = 1,
			Condition = {				
				--{{{
				login = 1,
				--}}}
				},
			Gap = 1440,
			CD = 10080,
			Inherit = 1,
			Max = 999999,
			--}}}
			},
		[2] = {			
			--{{{
			Des = "加入联机房间",
			Times = 2,
			Content = 70041,
			ID = 2,
			Jump = 11,
			Integral = 20,
			Title = 70024,
			Type = 1,
			Icon = 2,
			hard = 1,
			Condition = {				
				--{{{
				mulgame = 1,
				--}}}
				},
			Gap = 60,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[3] = {			
			--{{{
			Des = "创建房间",
			Times = 2,
			Content = 70042,
			ID = 3,
			Jump = 11,
			Integral = 20,
			Title = 70025,
			Type = 1,
			Icon = 3,
			hard = 1,
			Condition = {				
				--{{{
				createroom = 1,
				--}}}
				},
			Gap = 60,
			CD = 2880,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[4] = {			
			--{{{
			Des = "实名制",
			Times = 1,
			Content = 70043,
			ID = 4,
			Jump = 92,
			Integral = 150,
			Title = 70026,
			Type = 4,
			Icon = 4,
			hard = 1,
			Condition = {				
				--{{{
				auth_id = 1,
				--}}}
				},
			Gap = 0,
			CD = 999999,
			Inherit = 1,
			Max = 999999,
			--}}}
			},
		[5] = {			
			--{{{
			Des = "手机号认证",
			Times = 1,
			Content = 70044,
			ID = 5,
			Jump = 303,
			Integral = 150,
			Title = 70027,
			Type = 4,
			Icon = 5,
			hard = 1,
			Condition = {				
				--{{{
				auth_phone = 1,
				--}}}
				},
			Gap = 0,
			CD = 999999,
			Inherit = 1,
			Max = 999999,
			--}}}
			},
		[6] = {			
			--{{{
			Des = "邮箱认证",
			Times = 1,
			Content = 70045,
			ID = 6,
			Jump = 301,
			Integral = 150,
			Title = 70028,
			Type = 4,
			Icon = 6,
			hard = 1,
			Condition = {				
				--{{{
				auth_mail = 1,
				--}}}
				},
			Gap = 0,
			CD = 999999,
			Inherit = 1,
			Max = 999999,
			--}}}
			},
		[7] = {			
			--{{{
			Des = "帮好友浇水一次",
			Times = 2,
			Content = 70046,
			ID = 7,
			Jump = 6,
			Integral = 35,
			Title = 70029,
			Type = 3,
			Icon = 7,
			hard = 1,
			Condition = {				
				--{{{
				water_friend = 1,
				--}}}
				},
			Gap = 30,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[8] = {			
			--{{{
			Des = "观看广告",
			Times = 7,
			Content = 70047,
			ID = 8,
			Jump = 302,
			Integral = 50,
			Title = 70030,
			Type = 3,
			Icon = 8,
			hard = 1,
			Condition = {				
				--{{{
				ad_watch = 1,
				--}}}
				},
			Gap = 1440,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[9] = {			
			--{{{
			Des = "玩一局创造模式30分钟",
			Times = 2,
			Content = 70048,
			ID = 9,
			Jump = 11,
			Integral = 70,
			Title = 70031,
			Type = 1,
			Icon = 9,
			hard = 1,
			Condition = {				
				--{{{
				play_create_mod = 1,
				--}}}
				},
			Gap = 30,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[10] = {			
			--{{{
			Des = "玩一局对战模式并取得胜利",
			Times = 2,
			Content = 70049,
			ID = 10,
			Jump = 11,
			Integral = 75,
			Title = 70032,
			Type = 1,
			Icon = 10,
			hard = 1,
			Condition = {				
				--{{{
				play_battle_win = 1,
				--}}}
				},
			Gap = 60,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[11] = {			
			--{{{
			Des = "收藏一张地图",
			Times = 2,
			Content = 70050,
			ID = 11,
			Jump = 15,
			Integral = 50,
			Title = 70033,
			Type = 3,
			Icon = 11,
			hard = 1,
			Condition = {				
				--{{{
				collect_map = 1,
				--}}}
				},
			Gap = 60,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[12] = {			
			--{{{
			Des = "给地图投块",
			Times = 1,
			Content = 70051,
			ID = 12,
			Jump = 15,
			Integral = 50,
			Title = 70034,
			Type = 5,
			Icon = 12,
			hard = 1,
			Condition = {				
				--{{{
				deliver_chunk = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[13] = {			
			--{{{
			Des = "查看他人勋章",
			Times = 1,
			Content = 70052,
			ID = 13,
			Jump = 307,
			Integral = 25,
			Title = 70035,
			Type = 3,
			Icon = 13,
			hard = 1,
			Condition = {				
				--{{{
				watch_medal = 1,
				--}}}
				},
			Gap = 0,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[14] = {			
			--{{{
			Des = "添加一位好友",
			Times = 2,
			Content = 70053,
			ID = 14,
			Jump = 12,
			Integral = 40,
			Title = 70036,
			Type = 3,
			Icon = 14,
			hard = 1,
			Condition = {				
				--{{{
				add_friend = 1,
				--}}}
				},
			Gap = 0,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[15] = {			
			--{{{
			Des = "使用妮妮玩一盘游戏",
			Times = 1,
			Content = 70054,
			ID = 15,
			Jump = 308,
			Integral = 20,
			Title = 70037,
			Type = 1,
			Icon = 15,
			hard = 1,
			Condition = {				
				--{{{
				play_use_nini = 1,
				--}}}
				},
			Gap = 0,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[16] = {			
			--{{{
			Des = "挖取40块木头",
			Times = 1,
			Content = 70055,
			ID = 16,
			Jump = 11,
			Integral = 50,
			Title = 70038,
			Type = 1,
			Icon = 16,
			hard = 1,
			Condition = {				
				--{{{
				dig_wood = 40,
				--}}}
				},
			Gap = 0,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[17] = {			
			--{{{
			Des = "发表一次动态",
			Times = 2,
			Content = 70056,
			ID = 17,
			Jump = 309,
			Integral = 40,
			Title = 70039,
			Type = 3,
			Icon = 17,
			hard = 1,
			Condition = {				
				--{{{
				publish = 1,
				--}}}
				},
			Gap = 1440,
			CD = 10080,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[18] = {			
			--{{{
			Des = "击杀羽蛇神1次",
			Times = 2,
			Content = 70201,
			ID = 18,
			Jump = 310,
			Integral = 50,
			Title = 70101,
			Type = 1,
			Icon = 16,
			hard = 1,
			Condition = {				
				--{{{
				killsnakegod = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[19] = {			
			--{{{
			Des = "击败2个雨林祭司",
			Times = 2,
			Content = 70202,
			ID = 19,
			Jump = 311,
			Integral = 80,
			Title = 70102,
			Type = 1,
			Icon = 16,
			hard = 1,
			Condition = {				
				--{{{
				killjisi = 2,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[20] = {			
			--{{{
			Des = "家园宠物探险1次",
			Times = 2,
			Content = 70203,
			ID = 20,
			Jump = 312,
			Integral = 50,
			Title = 70103,
			Type = 1,
			Icon = 13,
			hard = 1,
			Condition = {				
				--{{{
				pet_explore = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[21] = {			
			--{{{
			Des = "家园种植果树1棵",
			Times = 2,
			Content = 70204,
			ID = 21,
			Jump = 312,
			Integral = 50,
			Title = 70104,
			Type = 1,
			Icon = 7,
			hard = 1,
			Condition = {				
				--{{{
				plant = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[22] = {			
			--{{{
			Des = "查看他人家园1次",
			Times = 2,
			Content = 70205,
			ID = 22,
			Jump = 312,
			Integral = 50,
			Title = 70105,
			Type = 3,
			Icon = 2,
			hard = 1,
			Condition = {				
				--{{{
				watch_home = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[23] = {			
			--{{{
			Des = "帮助他人除虫1次",
			Times = 2,
			Content = 70206,
			ID = 23,
			Jump = 6,
			Integral = 50,
			Title = 70106,
			Type = 3,
			Icon = 7,
			hard = 1,
			Condition = {				
				--{{{
				bug_friend = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[24] = {			
			--{{{
			Des = "他人个人中心点赞1次",
			Times = 2,
			Content = 70207,
			ID = 24,
			Jump = 313,
			Integral = 50,
			Title = 70107,
			Type = 3,
			Icon = 14,
			hard = 1,
			Condition = {				
				--{{{
				like_friend = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[25] = {			
			--{{{
			Des = "商城扭蛋抽奖1次",
			Times = 2,
			Content = 70208,
			ID = 25,
			Jump = 32,
			Integral = 100,
			Title = 70108,
			Type = 1,
			Icon = 15,
			hard = 1,
			Condition = {				
				--{{{
				store_roll = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[26] = {			
			--{{{
			Des = "赠送装扮1次",
			Times = 2,
			Content = 70209,
			ID = 26,
			Jump = 2,
			Integral = 200,
			Title = 70109,
			Type = 3,
			Icon = 1,
			hard = 1,
			Condition = {				
				--{{{
				give_beauty = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[27] = {			
			--{{{
			Des = "赠送avatar1次",
			Times = 2,
			Content = 70210,
			ID = 27,
			Jump = 26,
			Integral = 200,
			Title = 70110,
			Type = 3,
			Icon = 1,
			hard = 1,
			Condition = {				
				--{{{
				give_avatar = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		[28] = {			
			--{{{
			Des = "金果实抽奖1次",
			Times = 2,
			Content = 70211,
			ID = 28,
			Jump = 6,
			Integral = 100,
			Title = 70111,
			Type = 1,
			Icon = 15,
			hard = 1,
			Condition = {				
				--{{{
				goldfruit_roll = 1,
				--}}}
				},
			Gap = 0,
			CD = 1440,
			Inherit = 0,
			Max = 999999,
			--}}}
			},
		--}}}
		},
	ExpCard = {		
		--{{{
		[1] = {			
			--{{{
			ItemID = 10023,
			ExpUp = 300,
			--}}}
			},
		--}}}
		},
	BaseSetting = {		
		--{{{
		[1] = {			
			--{{{
			MaxIntegral = {				
				--{{{
				[1] = 1,
				[2] = 2000,
				--}}}
				},
			Mission = {				
				--{{{
				[1] = 1,
				[2] = 2,
				[3] = 3,
				[4] = 4,
				[5] = 5,
				[6] = 7,
				[7] = 8,
				[8] = 9,
				[9] = 10,
				[10] = 11,
				[11] = 12,
				[12] = 13,
				[13] = 14,
				[14] = 15,
				[15] = 17,
				--}}}
				},
			Remarks = 70000,
			ID = 1,
			OpenEnv = {				
				--{{{
				[1] = 0,
				[2] = 1,
				--}}}
				},
			Draw = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 1,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				[3] = {					
					--{{{
					[1] = 2,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				--}}}
				},
			GeneralReward = {				
				--{{{
				[1] = 21,
				[2] = 11,
				[3] = 10,
				[4] = 0,
				[5] = 16,
				[6] = 0,
				[7] = 0,
				[8] = 9,
				[9] = 0,
				[10] = 27,
				[11] = 0,
				[12] = 14,
				[13] = 12,
				[14] = 0,
				[15] = 0,
				[16] = 16,
				[17] = 13,
				[18] = 0,
				[19] = 0,
				[20] = 27,
				[21] = 0,
				[22] = 15,
				[23] = 0,
				[24] = 14,
				[25] = 12,
				[26] = 0,
				[27] = 20,
				[28] = 0,
				[29] = 16,
				[30] = 27,
				[31] = 0,
				[32] = 0,
				[33] = 3,
				[34] = 0,
				[35] = 9,
				[36] = 0,
				[37] = 1,
				[38] = 13,
				[39] = 0,
				[40] = 27,
				[41] = 0,
				[42] = 4,
				[43] = 0,
				[44] = 7,
				[45] = 17,
				--}}}
				},
			Type = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 10016,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 1,
					[2] = 10014,
					--}}}
					},
				--}}}
				},
			BattlePassReward = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 18,
					[2] = 14,
					[3] = 12,
					[4] = 13,
					[5] = 22,
					[6] = 11,
					[7] = 10,
					[8] = 15,
					[9] = 5,
					[10] = 23,
					[11] = 13,
					[12] = 3,
					[13] = 16,
					[14] = 14,
					[15] = 6,
					[16] = 9,
					[17] = 27,
					[18] = 10,
					[19] = 15,
					[20] = 24,
					[21] = 5,
					[22] = 13,
					[23] = 3,
					[24] = 11,
					[25] = 6,
					[26] = 27,
					[27] = 1,
					[28] = 9,
					[29] = 28,
					[30] = 25,
					[31] = 15,
					[32] = 3,
					[33] = 16,
					[34] = 28,
					[35] = 8,
					[36] = 2,
					[37] = 27,
					[38] = 10,
					[39] = 29,
					[40] = 26,
					[41] = 5,
					[42] = 9,
					[43] = 15,
					[44] = 29,
					[45] = 19,
					--}}}
					},
				--}}}
				},
			Price = {				
				--{{{
				[1] = 18,
				[2] = 36,
				[3] = 72,
				--}}}
				},
			Title = 1,
			Name = "狂野冲刺",
			CltVersion = "0.50.0",
			CloseTime  = 1518243199,
			OpenTime = 1509207200,
			--}}}
			},
		[2] = {			
			--{{{
			CltVersion = "0.53.15",
			BattlePassRewardadded = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 0,
					[3] = 0,
					[4] = 0,
					[5] = 50,
					[6] = 0,
					[7] = 0,
					[8] = 0,
					[9] = 0,
					[10] = 39,
					[11] = 0,
					[12] = 0,
					[13] = 0,
					[14] = 0,
					[15] = 60,
					[16] = 0,
					[17] = 0,
					[18] = 0,
					[19] = 0,
					[20] = 60,
					[21] = 0,
					[22] = 0,
					[23] = 0,
					[24] = 0,
					[25] = 43,
					[26] = 0,
					[27] = 0,
					[28] = 0,
					[29] = 0,
					[30] = 61,
					[31] = 0,
					[32] = 0,
					[33] = 0,
					[34] = 0,
					[35] = 38,
					[36] = 0,
					[37] = 0,
					[38] = 0,
					[39] = 0,
					[40] = 37,
					[41] = 0,
					[42] = 0,
					[43] = 0,
					[44] = 0,
					[45] = 32,
					--}}}
					},
				--}}}
				},
			Type = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 10016,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 1,
					[2] = 10014,
					--}}}
					},
				--}}}
				},
			BPRate = 0,
			Remarks = 70000,
			ChallengeMission = {				
				--{{{
				[1] = 1001,
				[2] = 1002,
				[3] = 1003,
				[4] = 1004,
				[5] = 1005,
				--}}}
				},
			ID = 2,
			OpenEnv = {				
				--{{{
				[1] = 0,
				[2] = 1,
				--}}}
				},
			GeneralReward = {				
				--{{{
				[1] = 30,
				[2] = 31,
				[3] = 32,
				[4] = 0,
				[5] = 33,
				[6] = 0,
				[7] = 0,
				[8] = 34,
				[9] = 0,
				[10] = 35,
				[11] = 0,
				[12] = 36,
				[13] = 37,
				[14] = 0,
				[15] = 38,
				[16] = 33,
				[17] = 0,
				[18] = 0,
				[19] = 0,
				[20] = 35,
				[21] = 0,
				[22] = 39,
				[23] = 0,
				[24] = 36,
				[25] = 37,
				[26] = 0,
				[27] = 40,
				[28] = 0,
				[29] = 33,
				[30] = 35,
				[31] = 0,
				[32] = 41,
				[33] = 42,
				[34] = 0,
				[35] = 34,
				[36] = 0,
				[37] = 43,
				[38] = 38,
				[39] = 0,
				[40] = 35,
				[41] = 0,
				[42] = 44,
				[43] = 0,
				[44] = 45,
				[45] = 46,
				--}}}
				},
			Draw = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 0,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				[2] = {					
					--{{{
					[1] = 1,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				[3] = {					
					--{{{
					[1] = 2,
					[2] = 2,
					[3] = 45,
					--}}}
					},
				--}}}
				},
			Name = "盛放繁花季",
			Title = 2,
			BattlePassReward = {				
				--{{{
				[1] = {					
					--{{{
					[1] = 47,
					[2] = 39,
					[3] = 43,
					[4] = 35,
					[5] = 48,
					[6] = 49,
					[7] = 32,
					[8] = 36,
					[9] = 31,
					[10] = 50,
					[11] = 42,
					[12] = 35,
					[13] = 34,
					[14] = 38,
					[15] = 51,
					[16] = 39,
					[17] = 43,
					[18] = 49,
					[19] = 35,
					[20] = 52,
					[21] = 32,
					[22] = 36,
					[23] = 31,
					[24] = 35,
					[25] = 53,
					[26] = 54,
					[27] = 42,
					[28] = 34,
					[29] = 38,
					[30] = 55,
					[31] = 56,
					[32] = 39,
					[33] = 43,
					[34] = 49,
					[35] = 57,
					[36] = 35,
					[37] = 54,
					[38] = 32,
					[39] = 36,
					[40] = 58,
					[41] = 31,
					[42] = 35,
					[43] = 56,
					[44] = 42,
					[45] = 59,
					--}}}
					},
				--}}}
				},
			CloseTime  = 1625068799,
			Mission = {				
				--{{{
				[1] = 1,
				[2] = 2,
				[3] = 3,
				[4] = 4,
				[5] = 5,
				[6] = 7,
				[7] = 8,
				[8] = 9,
				[9] = 10,
				[10] = 11,
				[11] = 12,
				[12] = 13,
				[13] = 15,
				[14] = 16,
				[15] = 19,
				[16] = 20,
				[17] = 21,
				[18] = 22,
				[19] = 23,
				[20] = 24,
				[21] = 25,
				[22] = 28,
				--}}}
				},
			Price = {				
				--{{{
				[1] = 18,
				[2] = 36,
				[3] = 72,
				--}}}
				},
			MaxIntegral = {				
				--{{{
				[1] = 1,
				[2] = 2000,
				--}}}
				},
			OpenTime = 1619488800,
			--}}}
			},
		--}}}
		},
	--}}}
}
--}}}

}