{
	--新广告系统开关
	NewAdSystem = { 
    	--新广告系统总开关
    	IsUseNewAdSystem = true,
    	-- 针对每个广告位单独设置开关
    	AdPositionId = {
        	[2] = true,
        	[3] = true,
        	[4] = true,
        	[5] = true,
        	[6] = true,
        	[7] = true,
        	[9] = true,
        	[10] = true,
        	[14] = true,
			[16] = true,
			[20] = true,
			[26] = true,
			[27] = true,
			[29] = true,
			[30] = true,
			[31] = true,
			[32] = true,
			[33] = true,
			[34] = true,
			[37] = true,
			[38] = true,
			[40] = true,
			[41] = true,
			[42] = true,
			[43] = true,
			[44] = true,
			[45] = true,
			[46] = true,
			[47] = true,
			[48] = true,
			[101] = true,
			[103] = true,
			[104] = true,
			[105] = true,
			[109] = true
    	},
		--针对迷你号设置开关
		IsUseUinList = false,
		--填写对应的迷你号，true表示可以使用新广告系统，否则使用老系统(方便后期测试)
		UinList = {
			[1000000382] = true,
		},
	},


	--新广告系统上报结算数据开关
	NewAdReportSystem = {
		version_min = "1.13.0",  --版本号控制
		
		--关闭发奖的渠道
		close_appids = {
			123,456,789
		},
	
		--新广告系统总开关
		IsUseNewAdSystem = true,
		-- 针对每个广告位单独设置开关
		AdPositionId = {
            [2] = false,        -- 冒险复活广告
			[5] = false,        -- 家园果实广告
            [7] = false,        -- 活动-获得迷你豆-观看广告代替一次分享

            [10] = false,       -- vivo渠道活动-插屏图片广告

            [14] = false,       -- 商城福利迷你点广告
            [16] = false,       -- 商城福利迷你点广告
            [26] = false,       -- 商城福利迷你点广告
            [40] = false,       -- 商城福利迷你点广告
            [41] = false,       -- 商城福利迷你点广告
            [42] = false,       -- 商城福利迷你点广告
            [43] = false,       -- 商城福利迷你点广告
            [44] = false,       -- 商城福利迷你点广告
            [45] = false,       -- 商城福利迷你点广告
            [46] = false,       -- 商城福利迷你点广告
            [47] = false,       -- 商城福利迷你点广告
            [48] = false,       -- 商城福利迷你点广告

            [9] = false,        -- 活动-福利广告
            [27] = false,       -- 活动-福利广告

            [29] = false,       -- 悦享卡广告

            [30] = false,       -- 心愿商人广告
            [31] = false,       -- 心愿商人广告

            [32] = false,       -- 活动-幸运方块广告
            [33] = false,       -- 活动-幸运方块广告

            [36] = false,       -- 商城-福利商店-迷你点离线收益广告  
            [38] = true,       -- 礼物广告 
            [101] = false,      -- 101开发者商店
            [102] = false,      -- 102开发者触发器
            [103] = false,      -- 103开发者通行证
            [104] = false,      -- 104资源工坊广告获取
            [105] = false,      -- 105开发者复活
            [106] = false,      -- 106开发者插屏
            [108] = false,      -- 108开发者触发器插屏-图片
            [109] = false,      -- 109开发者npc
		},
		--针对迷你号设置开关
		IsUseUinList = false,
		--填写对应的迷你号，true表示可以使用新广告系统，否则使用老系统(方便后期测试)
		UinList = {
			[1581891713] = true,
			[1581892629] = true,
			[1581893072] = true,
			[1581893962] = true,
		},
	},



	--模块-累计收益玩法
	Mode_accumulate = {
        --渠道控制
		apiids  = "1,2,3,7,10,11,12,13,15,21,28,29,32,34,36,39,45,49,50,55,56,57,58,60,65,69,70,71,72,73,74,78,79,80,82,83,84,85,86,92,93,94,96,97",
        --版本号控制
        version_min = "1.9.0",  

        --总开关：该模块功能是否开启
        starttime = 1644850800,    --活动开始时间戳，2022-02-14 23:00:00
		endtime = 1646063999,      --活动结束时间戳，2022-02-28 23:59:59

        --弹窗间隔(这个值必须大于找回时间)
        open_window_rate = 4,   --弹窗间隔， 单位为小时
		--收益找回时间
		back_reward_time = 0.5, --半小时内可找回， 单位为小时
        --各奖励类型的具体物品
        accumulate_rewards = {
            --普通物品奖励道具ID表, 单个物品需要配速率和上限
			[1] = {
                [10009] = {
					limit = 20,
					rate = 2.5,	
				},
		   },
			--广告奖励道具ID表
			[2] = {
				[10009] = {
					limit = 50,
					rate = 5,
				},
                [24827] = {
					limit = 3,
					rate = 0.5,	
				},
                [25021] = {
					limit = 3,
					rate = 0.5,
				},
			},
        },   

        --是否通知红点， 1代表通知， 无字段或者值为0代表关闭
        red_notify = {
			[1] = 1,        --标签-福利商店页面
            [2] = 0,        --标签-离线玩法页面
            [3] = 0,        --标签-福利站页面
        },
        --是否弹窗， 填入开启时间戳，无字段或者0代表关闭
        open_window_notify = {
			[1] = 1644850800,        --标签-福利商店页面 2022-02-14 23:00:00
            [2] = 0,        --标签-离线玩法页面 2021-11-29 17:36:57
            [3] = 0,        --标签-福利站页面 2021-11-29 17:36:57
        },

        --(活动/成就)增益值列表
 		delta_list = {
    		--key必须 对应活动ID
    		[1] = {	
        		task_name = "测试活动(成就)", --名称
        		delta_id = 1,				 --该活动ID
        		delta_rate = 2,              --累计速率增益
        		delta_limit = 50,            --累计上限增益
        		vaild_time = 2 * 24,		 --生效周期(按小时)
        		items = {10000, 10009,},	 --该活动生效的增益物品
    		},
		},
    },

}
