{
	battle_end_playmate_list = { -- 玩伴配置
        version_min = "1.11.0",
		apiids = '12'
	},
	uiscene_playmate_list = { -- 玩伴配置v2
        version_min = "1.11.0",
                apiids = '12'
        },
	activity_config = 
	{
		appid = 
		{
			appids = '1,2,999', --专门针对虚拟商城的ID
			--appids_no
		},	
		--白名单
		-- ["all"]	= 1				默认全部IP为白名单
		-- ["192.168.1.1"] = 1 		检测指定IP
		-- ["192.168.1.0/24"] = 2 	检测指定IP字段
		white_ip = 
		{
			--["all"] =	1,
			['124.71.120.241']    = 1, --活动php服
			['124.71.120.227']    = 1, --活动php服	
            ['119.147.210.241']   = 1,  --公司内部IP
            ['183.240.204.116']   = 1, --公司内部IP
            ['139.9.201.112']     = 1, --web国内活动服-01  
            ['124.71.213.21']     = 1, --web国内活动服-02
            ['124.71.120.14']     = 1, --web道具商城服务器-01  
            ['124.71.120.190']    = 1, --web道具商城服务器-02

			['139.9.201.112']=1,   --web国内活动服-01
			['124.71.213.21']=1,   --web国内活动服-02
			['124.71.120.158']=1,  --web国内活动服-03
			['124.71.98.30']=1,      --web活动测试服


			['106.53.148.94']=1,--互动剧
			['106.52.199.131']=1,--互动剧	
			['106.55.47.233']=1,--互动剧

    					['81.71.161.61']=1,--互动剧
                        ['106.53.123.68']=1,--互动剧
                        ['111.230.205.197']=1,--互动剧
                        ['111.230.198.21']=1,--互动剧


		},
		--物品类型--请勿删除
		--item_type=
		--{
		--	acc_type =1,  		--帐号仓库类型
		--	avt_type =2,  		--avt类型
		--  head_type =3,       --头像框
		--  skin_type = 4,      --皮肤类型
		--	mount_type = 5,     --坐骑类型
		--	homeland_type = 6,  --家园道具
		--},
	},

    main_config =
    {
        tips =
        {
            p0 = 1,
            p1 = 2,
            p2 = 3,
        },
        welfare =
        {
            startTime = '2022-01-05 11:15:00',                     -- 展示时间
            endTime = '2022-03-05 11:28:00',
            img_url  = 'https://image.mini1.cn/d/20220211/ea73bd4baa6ef0c00979ce998d816299.png',
            img_md5  = '76e5aa8e6c75f1326056c3f7be410d8cbfcabbe7',
            tips_str = '领取新春福利',
            tips_priority = 'p2',
			tips_duration = 10,
            jump_id = '50'

        },
    },

	-- 银享卡提醒邮件
	yxcard_notify_mail = {
		 title = '银享卡奖励领取提醒',
         body = '当前有银享卡奖励未领取,请及时领取奖励哦。',
         jump_name = '前往领取',
         jump_to = 1001,
         type = 0,
	},

    -- 首页feed流配置
    HomePageFeeds =
    {
        conf =
        {
            page_view_num = 20,  -- 单次请求下发数量
            default_channel = 'default'  -- 指定默认渠道,没配置渠道的都按这个渠道下发
        },
        -- 显示配置
        -- 客户端按配置的顺序显示
        indexes =
        {
            --[[
                -- 语言包id定义来源于客户端代码
                LANGUAGE_ZH		= 0, //简体中文
                LANGUAGE_EN		= 1, //英语
                LANGUAGE_ZHTW	= 2, //繁体中文
                LANGUAGE_THA	= 3, //泰文
                LANGUAGE_ESN	= 4, //西班牙
                LANGUAGE_PTB	= 5, //巴西葡萄牙
                LANGUAGE_FRA	= 6, //法文
                LANGUAGE_JPN	= 7, //日文
                LANGUAGE_ARA	= 8, //阿拉伯文
                LANGUAGE_KOR	= 9, //韩语
                LANGUAGE_VIE	= 10,//越南
                LANGUAGE_RUS	= 11,//俄语
                LANGUAGE_TUR	= 12,//土耳其
                LANGUAGE_ITA	= 13,//意大利
                LANGUAGE_GER	= 14,//德语
                LANGUAGE_IND	= 15,//印尼语
                LANGUAGE_MSA	= 16,//马来语                
            ]]--
            [0] =  -- 语言包: 0-简体中文，1-英语， 2-繁体中文，...
            {
                -- [渠道id] = {feedid_1, feedid_2, feedid_3, feedid_4 }
                default = -- 默认列表,可以为空列表，但是必须有这项
                {
                    100001,100002,100003,100004
                },
                [21] =  -- 45 渠道显示列表
                {
                    100001,100002,100003,100004
                },
                [101] = --测试有效时间 
                {
                    100001,100002,100003,100004
                },
                [109] = --测试无效时间，配置7个，显示6个，100005不在活动时间内
                {
                    100001,100002,100003,100004
                },
                [110] = --大于这个版本号，显示2个
                {
                    100001,100002,100003,100004
                },
                [112] = --小于这个版本号不生效，显示3个
                {
                    100001,100002,100003,100004
                },
                [115] = --特定版本号，显示4个
                {
                    100001,100002,100003,100004
                },
                [121] = --大于这个版本号,不生效；显示3个
                {
                    100001,100002,100003,100004
                }, 
                [122] = --小于这个版本号,不生效；显示5个
                {
                    100001,100002,100003,100004
                },
                [125] = --大于这个版本号（边界值）,不生效；显示4个
                {
                    100001,100002,100003,100004
                }, 
                [126] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                }, 
                [127] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                }, 
                [130] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [131] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [132] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [199] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [499] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [610] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [998] = --小于这个版本号（边界值）,不生效；显示6个
                {
                    100001,100002,100003,100004
                },
                [888] = --#######附加测上限1-3，9-11，16-29（合计20个）
                {
                    100001, 100002, 100003, 100009, 100010,
                    100011, 100016, 100017, 100018, 100019,
                    100020, 100021, 100022, 100023, 100024,
                    100025, 100026, 100027, 100028, 100029,
                },
                [12] = --#######按钮跳转测试，充值，家园，存档下载，装扮，迷你工坊，多人联机...
                {   
                    100001,100002,100003,100004    
                },
                

            },
            [1] =  -- 语言包: 0-简体中文，1-英语， 2-繁体中文，...
            {
                -- 默认显示列表
                default = { 100001, 100002, 100003, 100004 },
                -- [渠道id] = {feedid_1, feedid_2, feedid_3, feedid_4 }
                [9999]  = { 100001, 100002, 100003, 100004 },
                [45]    = { 100001, 100002, 100003, 100004 },
                [16]    = { 100001, 100002, 100003, 100004 },
            }
        },
        -- feed 配置池
        pool =
        {
			{
                -- 必填
                id          = 100001, -- 不在时间内
                category    = 0,      -- 0-官方活动
              display     = 'https://image.mini1.cn/d/20220311/66259f75da9f0dc3e596893431aecb1b.png',
                jump_type   = 1,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 's4_https://sso.mini1.cn/#/transit?url=https://h5.mini1.cn/act/c5m/my2021/&portrait=1&openBrowser=3',
                -- 选配, 可注释
                -- start_time  = '2022-03-14 00:00:00',   -- 活动开始时间
                -- final_time  = '2022-03-20 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
			{
                -- 必填
                id          = 100002, -- 不在时间内
                category    = 0,      -- 0-官方活动
              display     = 'https://image.mini1.cn/d/20220308/113ad4442571962c9ee431a0d38e0a39.png',
                jump_type   = 2,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 's4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/1/detail/1192/contribute',
                -- 选配, 可注释
                -- start_time  = '2022-03-09 00:00:00',   -- 活动开始时间
                -- final_time  = '2022-03-22 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
			{
                -- 必填
                id          = 100003, -- feedid
                category    = 0,      -- 0-官方活动
                display     = 'https://image.mini1.cn/d/20220222/7e345bb19f95f9cd4d4c5c036c9b796c.png',
                jump_type   = 0,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 2,
                -- 选配, 可注释
                -- start_time  = '2022-03-08 00:00:00',   -- 活动开始时间
                   final_time  = '2022-03-16 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
			{
                -- 必填
                id          = 100004, -- 在时间内
                category    = 0,      -- 0-官方活动
                display     = 'https://image.mini1.cn/d/20220222/63ba105c8339d5f87cc4ab9d299e8023.png',
                jump_type   = 0,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 57,
                -- 选配, 可注释
                start_time  = '2022-02-22 00:00:00',   -- 活动开始时间
                final_time  = '2022-03-16 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
            {
                -- 必填
                id          = 100007, -- 不在时间内
                category    = 0,      -- 0-官方活动
              display     = 'https://image.mini1.cn/d/20220221/988e8b7413b89d72d4893bf2a81e9cee.png',
                jump_type   = 0,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 59,
                -- 选配, 可注释
                -- start_time  = '2022-02-11 00:00:00',   -- 活动开始时间
                -- final_time  = '2022-03-13 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
            {
               -- 必填
                id          = 100008, -- 不在时间内
                category    = 0,      -- 0-官方活动
              display     = 'https://image.mini1.cn/d/20220303/b8e981d0e574a67c8170e2a698bd9f4f.png',
                jump_type   = 0,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = 203,
                -- 选配, 可注释
                -- start_time  = '2022-03-04 00:00:00',   -- 活动开始时间
                -- final_time  = '2022-03-06 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
            {
                -- 必填
                id          = 100009, -- feedid
                category    = 0,      -- 0-官方活动
             display     = 'https://image.mini1.cn/d/20220222/4d922784a4900afcfd552ec8a6a22684.png',
                jump_type   = 0,            -- 0-端内跳转 1-内置浏览器 2-外部浏览器
                jump_to     = '23,articleId=157058555906912256',
                -- 选配, 可注释
                --start_time  = '2022-02-22 00:00:00',   -- 活动开始时间
                --final_time  = '2022-03-06 23:59:59',   -- 活动结束时间
                -- min_version = '1.7.0',
                -- max_version = '2.0.0',
            },
        },
    },
}
