-- market activity  utf-8
{
	--常见问题类
	{
		
		{
			--问题
			q = '迷你世界游戏？',
			--回复
			a = 
			--标题
			'迷你世界是个什么样的游戏？#n'
			..'\n'..  --连接上下文
			'      迷你世界是款创造类沙盒游戏，可以简单想象成由无数个方块积木搭建起来的真实世界，所有方块可以随意的破坏和组合，充分发挥想象力，你会建设出属于自己的世界。'
			..'\n'..  --连接上下文
			'      你可以先看看迷你工坊，每天都有无数的小伙伴把许多新奇的地图存档分享出来，有些非常有趣。'
			..'\n'..  --连接上下文
			'      如果你已经很熟悉迷你世界，甚至能创造出属于自己的游戏玩法，把你有趣的想法在地图中创建出来，分享给其他小伙伴，让大家共同来玩。'			
			,
			
		},
		
		{
			q = '新手必看',
			a = 
			--标题
			'我是新手，冒险模式该怎么玩呢？#n'
			..'\n'..  --连接上下文
			'·首先采集木头，用#G斧头砍树#n会比较快，多关注地图下方的成就指引任务。'
			..'\n'..  --连接上下文
			'·获得足够木头后，可以在#G背包合成工具箱#n，工具箱是最重要的，绝大部分物品都是通过工具箱合成制作出来，当然前提是需要有足够的材料。'
			..'\n'..  --连接上下文
			'·用#G木稿采集石头#n，石头通过工具箱制作成更高级的工具。'
			..'\n'..  --连接上下文
			'·接下来，你要#G找到食物#n，别让自己饿肚子。'
			..'\n'..  --连接上下文
			'·夜晚来临，野人开始出没，赶紧#G搭建个小房子或者挖个地洞#n把自己藏起来。'
			..'\n'..  --连接上下文
			'·如果平安度过初个夜晚，你的冒险生存开始了，多想想怎么利用周围的环境获得资源。'
			..'\n'..  --连接上下文
			'·最后，可以邀请小伙伴，共同来建设你的家园。'
			,
			
		},
		

		
		{
			q = '怎么下载存档',
			a = 
			--标题
			'怎么下载存档？#n'
			..'\n'..  --连接上下文
			'主界面右下角有#G下载存档#n按钮，进入下载存档界面。'
			..'\n'..  --连接上下文
			'有大量非常有趣的玩家分享的地图存档，点击下载即可。'
			..'\n'..  --连接上下文
			'#G输入指定的迷你号搜索#n，可以找到自己或者指定小伙伴分享的存档地图。'
			,
			
		},
		
		{
			q = '上传和删除存档',
			a = 
			--标题
			'怎么上传和删除存档地图？#n'
			..'\n'..  --连接上下文
			'选中你要上传或删除的存档地图，点击右侧的齿轮按钮，会出现上传地图和删除按钮，是不是很神奇！'
			..'\n'..  --连接上下文
			'存档公开上传后，会进入审核期，地图审核完毕后会传入迷你工坊，大家都能看到你的地图。'
			..'\n'..  --连接上下文
			'没有分享的存档，删除后就永久消失了哦！切换设备时没分享的存档会不见，无法找回，需要注意！'
			,
					
		},

		{
			q = '存档丢失',
			a = 
			--标题
			'存档丢失怎么找回？#n'
			..'\n'..  --连接上下文
			'没有分享过的存档是保存在您的设备中的，所以丢失了没办法找回和恢复。'
			..'\n'..  --连接上下文
			'分享过的存档可以前往迷你工坊搜索自己的迷你号下载。'
			,
			
		},
		
		{
			q = '怎么提取道具到存档？',
			a = 
			--标题
			'怎么提取道具到存档？#n'
			..'\n'..  --连接上下文
			'先进入冒险、模拟冒险模式的存档（创造模式不可以哦~）'
			..'\n'..  --连接上下文
			'点右上角的“商城”图标打开“仓库”标签'
			..'\n'..  --连接上下文
			'点道具图标，再点“提取”按钮即可。'
			,
					
		},
		
		
		{
			q = '游戏卡顿、闪退',
			a = 
			--标题
			'游戏卡顿、闪退怎么办？#n'
			..'\n'..  --连接上下文
			'请确保在网络良好的情况下进行联机模式。\n检查设备内存情况，关闭部分后台程序软件，退出重新登录游戏试试看。',
			
		},
		
		{
			q = '进不去别人的房间？',
			a = 
			--标题
			'为什么进不去其他人的房间？#n'
			..'\n'..  --连接上下文
			'如果是某个玩家的房间进不去，有可能是与房主网络不匹配，可以过段时间再试，或者尝试进入其他房间。如果是所有房间都进不了，请参考以下指引：'
			..'\n'..  --连接上下文
			'重启动游戏。'
			..'\n'..  --连接上下文
			'可能房间人数繁忙，过段时间再试。'
			..'\n'..  --连接上下文
			'换个WIFI试下，有些WIFI关闭了游戏端口。'
			..'\n'..  --连接上下文
			'选择有PC标志（有个小电脑图标）的房间会更稳定。'
			,
					
		},
				
	},
	--帐号问题类

	
	{
		{
			q = '怎么切换帐号',
			a = '怎么切换帐号？#n\n点右上角设置按钮=》账号设置=》切换迷你号=》输入迷你号和密码=》切换。\n注意：部分平台由于平台规则不允许切换迷你号。',
		},
		
		
		
		{
			q = '手机绑定与切换迷你号',
			a = 
			--标题
			'切换迷你号，为什么要绑定手机？#n'
			
			..'\n'..  --连接上下文
			'迷你号绑定手机号后，可找回迷你号，方便切换到新设备。'
			..'\n'..  --连接上下文
			'切换新设备，可以绑定手机号验证，再不担心换新手机了！'
		
			..'\n'..  --连接上下文
			'同个手机号只能绑定同个迷你号。'
			..'\n'..  --连接上下文
			'可以点击绑定页面右侧解绑按钮解绑手机号，请使用常用手机号码，注意帐号安全。'	
			..'\n'..  --连接上下文
			'注意：部分平台由于平台规则没有切换迷你号或绑定手机功能。'	
			,
			
		},
		
		{
			q = '切换账号提示平台不同',
			a = 
			--标题
			'为什么切换账号提示平台不同？#n'
			..'\n'..  --连接上下文
			'迷你号是对应平台的，平台不同无法登录。在某个平台下载的游戏，必须去同平台的应用商店下载更新。'
			,
			
		},
		
		
		
		{
			q = '为什么迷你号显示***',
			a = 
			--标题
			'为什么迷你号显示***？#n'
			
			..'\n'..  --连接上下文
			'这是由于没有网络，读取不到迷你号导致的，可能是以下原因：'
			..'\n'..  --连接上下文
			'维护期间所有网络功能都使用不了，请留意游戏公告、官网是否有维护公告。'
		
			..'\n'..  --连接上下文
			'没有开网络，请检查wifi、流量开关，或重启尝试。'
					
		},

		{
			q = '版本更新',
			a = 
			--标题
			'为什么别人更新了新版本，我却不能更新？#n'
			
			..'\n'..  --连接上下文
			'每个平台的审核流程和要求都不一样，新版本上线时间也会略有不同（可能部分平台会晚几天更新）。'
			..'\n'..  --连接上下文
			'在您下载迷你世界的应用商店或游戏中心搜索迷你世界，就能知道是否可以更新啦。'
		

					
		},

		
	},
	--充值问题类
	{
		{
			q = '游戏里怎么充值',
			a = '游戏内怎么充值？#n \n1、点击游戏界面上方右侧的“+”按钮进行充值。\n2、进入商城，点击右下方的充值按钮进行充值。',
		},

		{
			q = '充值不到账怎么办',
			a = '充值不到账怎么办？#n'
			..'\n'..  --连接上下文
			'充值的时候不要点太快！充值后提示：充值成功，由于网络原因不到账时，请多点几次“重试”，然后退出游戏再看迷你币。若重进几次游戏后还是没有到账，请联系微信公众号：迷你世界粉丝阵地（回复“客服”）！'
			..'\n'..  --连接上下文
			'请提供迷你号和充值凭证（交易订单详情截图），短信充值可提供短信和手机号\n充值的时候可能会遇到网络不稳定的情况，请稍后重启游戏再试。\n'

		},
		
		{
			q = '迷你币没了？',
			a = 
			--标题
			'为什么我的虚拟货币时有时没？#n'
			
			..'\n'..  --连接上下文
			'这种情况可能是网络不稳定造成的，可以进行以下行为再查看迷你币是否恢复：'
			..'\n'..  --连接上下文
			'退出游戏重进，再重新查看'
		
			..'\n'..  --连接上下文
			'进入冒险、模拟冒险的存档，从仓库里提取物品到存档里，再重新查看。'
					
		},

		{
			q = '有人说自己是官方客服，真的吗？',
			a = '官方客服请联系微信公众号：迷你世界粉丝阵地（回复“客服”），官方QQ仅有一个：800800864；\n'
			..  '客服联系方式：0755-66821978（专线），其余均为假冒!\n'
			..  '官方不会以任何形式向玩家索取账号密码(迷你号、QQ号、微信号等等）。\n'
			..  '官方也从未授权任何组织或个人发放装扮激活码,非官方联动活动均为假冒。\n'
			..  '请各位冒险家确认清楚官方身份,避免上当受骗,造成不必要的损失。\n',

			
		}, 

		{
			q = '有加群领取皮肤吗？',
			a = '#c4876FF 有加群领取皮肤吗？#n\n'
			..  '让你加群领取皮肤的都是骗子哦! 骗子通过在不同的平台发布加群信息，等待受害人主动上门。\n'
			..  '并且通过群里人数多的属性，营造出一种人多就真实的错觉，进一步降低受害人的心理防线。\n'
			..  '还会制作假的图片来获取你的信任，让你去借来父母的手机进行验证或扫描二维码。\n'
			..  '如果你扫了二维码，骗子还会威胁说一旦不配合就会导致父母的相关账号受到封禁。这些都是假的哦！一定不要相信！',

			
		},

		{
			q = '遇到骗子了怎么办？',
			a = '#c4876FF 遇到骗子了怎么办？#n\n'
			..  '如果在游戏内或者qq群遇到了骗子，首先要注意不要上当。及时的通知父母，保存聊天图片等证据进行举报。\n'
			..  '如果已经上当受骗，也不要慌张，不要担心责骂，首先要做的事，通知父母进行报警，越早报警，才更有可能挽回损失！\n',

			
		},
		
	},	
	
	
	
};
