
----utf-8-----------v2111

{
{
        title = "皮肤装扮福利",
        id = 30368,
 {
            id = 50072,
            title = "获得孔雀装扮-浣溪可领取（首次获得装扮请等候1小时后重登游戏领取）",
            start_time = '2022-09-30 10:00:00',
            end_time = '2022-12-30 23:59:59',
            close_time = '2022-12-30 23:59:59',
            action = 1003,
            action_txt = "前往获取",
            conditions = {
                version_min = "0.48.0"
            },
            task_conditions = {
                OwnedSkin = {269}
            },
            gift = {{
                id = 90002,
                num = 1
},
{
               id = 86002,
                num = 1
            }}
        },
},


{
        title = "铃铛换豪礼",   
        id = 3042722, 
        {
            id = 446822,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-02-10 00:00:00',
            end_time = '2023-02-16 23:59:59',
            close_time = '2023-02-16 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  446922,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-02-10 00:00:00',
            end_time = '2023-02-16 23:59:59',
            close_time = '2023-02-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  447022,
            title = "每日前往福利商城",
            start_time = '2023-02-10 00:00:00',
            end_time = '2023-02-16 23:59:59',
            close_time = '2023-02-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  447122,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-02-10 00:00:00',
            end_time = '2023-02-16 23:59:59',
            close_time = '2023-02-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},

{
        title = "金蛋赠礼",   
        id = 3042611, 
        {
            id = 446411,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-02-03 00:00:00',
            end_time = '2023-02-09 23:59:59',
            close_time = '2023-02-09 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 446511,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-02-03 00:00:00',
            end_time = '2023-02-09 23:59:59',
            close_time = '2023-02-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 446611,
            title = "每日前往福利商城",
            start_time = '2023-02-03 00:00:00',
            end_time = '2023-02-09 23:59:59',
            close_time = '2023-02-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 446711,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-02-03 00:00:00',
            end_time = '2023-02-09 23:59:59',
            close_time = '2023-02-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "福气铃铛",   
        id = 3042622, 
        {
            id = 446422,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-01-27 00:00:00',
            end_time = '2023-02-02 23:59:59',
            close_time = '2023-02-02 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  446522,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-01-27 00:00:00',
            end_time = '2023-02-02 23:59:59',
            close_time = '2023-02-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  446622,
            title = "每日前往福利商城",
            start_time = '2023-01-27 00:00:00',
            end_time = '2023-02-02 23:59:59',
            close_time = '2023-02-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  446722,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-01-27 00:00:00',
            end_time = '2023-02-02 23:59:59',
            close_time = '2023-02-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "新春金蛋豪礼",   
        id = 3042511, 
        {
            id = 446011,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-01-20 00:00:00',
            end_time = '2023-01-26 23:59:59',
            close_time = '2023-01-26 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 446111,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-01-20 00:00:00',
            end_time = '2023-01-26 23:59:59',
            close_time = '2023-01-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 446211,
            title = "每日前往福利商城",
            start_time = '2023-01-20 00:00:00',
            end_time = '2023-01-26 23:59:59',
            close_time = '2023-01-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 446311,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-01-20 00:00:00',
            end_time = '2023-01-26 23:59:59',
            close_time = '2023-01-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "福利铃铛响响",   
        id = 3042422, 
        {
            id = 445622,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-01-13 00:00:00',
            end_time = '2023-01-19 23:59:59',
            close_time = '2023-01-19 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  445722,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-01-13 00:00:00',
            end_time = '2023-01-19 23:59:59',
            close_time = '2023-01-19 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  445822,
            title = "每日前往福利商城",
            start_time = '2023-01-13 00:00:00',
            end_time = '2023-01-19 23:59:59',
            close_time = '2023-01-19 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  445922,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-01-13 00:00:00',
            end_time = '2023-01-19 23:59:59',
            close_time = '2023-01-19 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "冬季金蛋送豪礼",   
        id = 3042311, 
        {
            id = 445211,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2023-01-06 00:00:00',
            end_time = '2023-01-12 23:59:59',
            close_time = '2023-01-12 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 445311,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2023-01-06 00:00:00',
            end_time = '2023-01-12 23:59:59',
            close_time = '2023-01-12 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 445411,
            title = "每日前往福利商城",
            start_time = '2023-01-06 00:00:00',
            end_time = '2023-01-12 23:59:59',
            close_time = '2023-01-12 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 445511,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2023-01-06 00:00:00',
            end_time = '2023-01-12 23:59:59',
            close_time = '2023-01-12 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},

{
        title = "铃铛新气象",   
        id = 3042222, 
        {
            id = 444822,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-12-30 00:00:00',
            end_time = '2023-01-05 23:59:59',
            close_time = '2023-01-05 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  444922,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-12-30 00:00:00',
            end_time = '2023-01-05 23:59:59',
            close_time = '2023-01-05 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  445022,
            title = "每日前往福利商城",
            start_time = '2022-12-30 00:00:00',
            end_time = '2023-01-05 23:59:59',
            close_time = '2023-01-05 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  445122,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-12-30 00:00:00',
            end_time = '2023-01-05 23:59:59',
            close_time = '2023-01-05 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "冬日金蛋福利",   
        id = 3042111, 
        {
            id = 444411,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-12-23 00:00:00',
            end_time = '2022-12-29 23:59:59',
            close_time = '2022-12-29 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 444511,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-12-23 00:00:00',
            end_time = '2022-12-29 23:59:59',
            close_time = '2022-12-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 444611,
            title = "每日前往福利商城",
            start_time = '2022-12-23 00:00:00',
            end_time = '2022-12-29 23:59:59',
            close_time = '2022-12-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 444711,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-12-23 00:00:00',
            end_time = '2022-12-29 23:59:59',
            close_time = '2022-12-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "冬季铃铛送豪礼",   
        id = 3042022, 
        {
            id = 444022,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-12-16 00:00:00',
            end_time = '2022-12-22 23:59:59',
            close_time = '2022-12-22 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  444122,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-12-16 00:00:00',
            end_time = '2022-12-22 23:59:59',
            close_time = '2022-12-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  444222,
            title = "每日前往福利商城",
            start_time = '2022-12-16 00:00:00',
            end_time = '2022-12-22 23:59:59',
            close_time = '2022-12-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  444322,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-12-16 00:00:00',
            end_time = '2022-12-22 23:59:59',
            close_time = '2022-12-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "金蛋豪礼送送送",   
        id = 3041911, 
        {
            id = 443611,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-12-09 00:00:00',
            end_time = '2022-12-15 23:59:59',
            close_time = '2022-12-15 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 443711,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-12-09 00:00:00',
            end_time = '2022-12-15 23:59:59',
            close_time = '2022-12-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 443811,
            title = "每日前往福利商城",
            start_time = '2022-12-09 00:00:00',
            end_time = '2022-12-15 23:59:59',
            close_time = '2022-12-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 443911,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-12-09 00:00:00',
            end_time = '2022-12-15 23:59:59',
            close_time = '2022-12-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},




{
        title = "铃铛月月福利",   
        id = 3041822, 
        {
            id = 443222,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-12-02 00:00:00',
            end_time = '2022-12-08 23:59:59',
            close_time = '2022-12-08 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id =  443322,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-12-02 00:00:00',
            end_time = '2022-12-08 23:59:59',
            close_time = '2022-12-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id =  443422,
            title = "每日前往福利商城",
            start_time = '2022-12-02 00:00:00',
            end_time = '2022-12-08 23:59:59',
            close_time = '2022-12-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id =  443522,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-12-02 00:00:00',
            end_time = '2022-12-08 23:59:59',
            close_time = '2022-12-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "天降金蛋福利",   
        id = 3041711, 
        {
            id = 442811,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-11-25 00:00:00',
            end_time = '2022-12-01 23:59:59',
            close_time = '2022-12-01 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 442911,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-11-25 00:00:00',
            end_time = '2022-12-01 23:59:59',
            close_time = '2022-12-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 443011,
            title = "每日前往福利商城",
             start_time = '2022-11-25 00:00:00',
            end_time = '2022-12-01 23:59:59',
            close_time = '2022-12-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 443111,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-11-25 00:00:00',
            end_time = '2022-12-01 23:59:59',
            close_time = '2022-12-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "铃铛赐礼",   
        id = 3041622, 
        {
            id = 442522,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-11-18 00:00:00',
            end_time = '2022-11-24 23:59:59',
            close_time = '2022-11-24 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 442622,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-11-18 00:00:00',
            end_time = '2022-11-24 23:59:59',
            close_time = '2022-11-24 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 442722,
            title = "每日前往福利商城",
            start_time = '2022-11-18 00:00:00',
            end_time = '2022-11-24 23:59:59',
            close_time = '2022-11-24 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 442822,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-11-18 00:00:00',
            end_time = '2022-11-24 23:59:59',
            close_time = '2022-11-24 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},

{
        title = "秋季金蛋豪礼",   
        id = 30415, 
        {
            id = 4421,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-11-11 00:00:00',
            end_time = '2022-11-17 23:59:59',
            close_time = '2022-11-17 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4422,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-11-11 00:00:00',
            end_time = '2022-11-17 23:59:59',
            close_time = '2022-11-17 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4423,
            title = "每日前往福利商城",
            start_time = '2022-11-11 00:00:00',
            end_time = '2022-11-17 23:59:59',
            close_time = '2022-11-17 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4424,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-11-11 00:00:00',
            end_time = '2022-11-17 23:59:59',
            close_time = '2022-11-17 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "铃铛豪礼领不停",   
        id = 30414, 
        {
            id = 4417,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-11-04 00:00:00',
            end_time = '2022-11-10 23:59:59',
            close_time = '2022-11-10 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4418,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-11-04 00:00:00',
            end_time = '2022-11-10 23:59:59',
            close_time = '2022-11-10 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4419,
            title = "每日前往福利商城",
            start_time = '2022-11-04 00:00:00',
            end_time = '2022-11-10 23:59:59',
            close_time = '2022-11-10 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4420,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-11-04 00:00:00',
            end_time = '2022-11-10 23:59:59',
            close_time = '2022-11-10 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "福利金蛋降临",   
        id = 30413, 
        {
            id = 4413,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-10-28 00:00:00',
            end_time = '2022-11-03 23:59:59',
            close_time = '2022-11-03 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4414,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-10-28 00:00:00',
            end_time = '2022-11-03 23:59:59',
            close_time = '2022-11-03 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4415,
            title = "每日前往福利商城",
            start_time = '2022-10-28 00:00:00',
            end_time = '2022-11-03 23:59:59',
            close_time = '2022-11-03 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4416,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-10-28 00:00:00',
            end_time = '2022-11-03 23:59:59',
            close_time = '2022-11-03 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "领铃铛拿福利",   
        id = 30412, 
        {
            id = 4409,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-10-21 00:00:00',
            end_time = '2022-10-27 23:59:59',
            close_time = '2022-10-27 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4410,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-10-21 00:00:00',
            end_time = '2022-10-27 23:59:59',
            close_time = '2022-10-27 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4411,
            title = "每日前往福利商城",
            start_time = '2022-10-21 00:00:00',
            end_time = '2022-10-27 23:59:59',
            close_time = '2022-10-27 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4412,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-10-21 00:00:00',
            end_time = '2022-10-27 23:59:59',
            close_time = '2022-10-27 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "限时福利",
        id = 88881111,
        {
            id = 88881111,
            title = "首次完成手机绑定，领取丰富奖励！如无法领取请重启游戏！",
            hide   = 1,
                        isNew=1,
            start_time = '2022-04-28 10:00:00', 
            end_time = '2024-12-31 23:59:59', 
            close_time = '2024-12-31 23:59:59', 
            action  = 100,
            action_txt = '前往绑定',
            conditions = {
            --version_min = "1.12.0",
                        --apiids = '1',
            apiids_no = '52,21',
            },
            task_conditions = {
                first_bind = 1,
            },
            gift = {
                                { id = 20065, num = 10 },   
               }, 
        },
  { 
            id =50047, 
            title = "加入迷你世界官方社区服务器，参加活动可免费兑换定制装扮！", 
            start_time = '2022-11-29 00:00:00', 
            end_time = '2022-12-25 23:59:59', 
            close_time = '2022-12-25 23:59:59', 
            action =99, 
            action_txt = '立即加入', 
            action_url = "https://fanbook.mobi/circle/436534153316401152?ic=JKlSKFee&openBrowser=1",
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
           apiids ="45,1,110,69,96,92,94,65,74,80,112,50,67,78,71,113,84,95,73,82,70,83,77,90,49,10,999",
            },
            task_conditions = { 
                login_day = 0, }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12963, num = 1 }, 
            }, 
        }, 
{ 
            id = 50020, 
            title = "参与农行数币抽奖活动，赢《迷你世界》盲盒和永久精美装扮！", 
            start_time = '2022-07-01 17:00:00', 
            end_time = '2022-12-31 23:59:59', 
            close_time = '2022-12-31 23:59:59',  
            action = 99, 
            action_txt = '点击参与', 
            action_url ="https://merch.szx.abchina.com.cn/wbank/html/openRoutine.html?path=/activePages/pages/active/index&page=mnsjnhspf&networkCode=410233&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {      
apiids_no=
"36,45,21,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
--apiids="1,110,69,96,92,94,65,74,80,112,50,67,78,71,113,84,95,73,82,70,83,77,90,49,10,999",
 }, 
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12963, num =1  }, 
            }, 
        }, 
  },

{ 
        title = "三丽鸥家族联动福利", 
        id = 30352,
                { 
            id = 50051, 
            title = "模拟经营玩法升级，限时免费领取三丽鸥家族定制家具。", 
            start_time = '2022-08-17 10:00:00', 
            end_time = '2022-09-09 23:59:59', 
            close_time = '2022-09-09 23:59:59', 
            action = 80, 
            action_txt = '立即前往', 
            --action_url="https://y.qq.com/jzt/271ddc/c4b05f.html?jztid=2014&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.17.0",
            --apiids = '999,1,110',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{ 
        title = "中秋庆典福利", 
        id = 30357,
{ 
            id = 50060, 
            title = "参与中秋庆典，体验习俗玩法，还有丰厚奖励等着你!", 
            start_time = '2022-09-10 10:00:00', 
            end_time = '2022-09-30 23:59:59', 
            close_time = '2022-09-30 23:59:59', 
            action = 81, 
            action_txt = '立即前往', 
            --action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.18.0",
            --apiids_no = '52,7,12,13,21,36,45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
                { 
            id = 50058, 
            title = "快手中秋梦幻游，看视频领中秋梦幻礼物", 
            start_time = '2022-09-09 18:00:00', 
            end_time = '2022-09-12 23:59:59', 
            close_time = '2022-09-12 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.17.0",
            apiids_no = '52,7,12,13,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12855, num = 1 }, 
            }, 
        }, 


 { 
            id = 50059, 
            title = "快乐团圆抽好礼，看抖音视频一起过中秋", 
            start_time = '2022-09-10 9:00:00', 
            end_time = '2022-09-12 23:59:59', 
            close_time = '2022-09-12 23:59:59', 
            action = 99, 
            action_txt = '前往参与',            action_url="https://aweme.snssdk.com/magic/eco/runtime/release/631adec2f160c7034edbf5b1?appType=douyin&title_color=ffffff&nav_bar_color=000000&status_bar_color=000000&magic_page_no=1&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.17.0",
            apiids_no = '52,7,12,13,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12855, num = 1 }, 
            }, 
        }, 
 },

{
        title = "金蛋福利降临",   
        id = 30411, 
        {
            id = 4404,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-10-14 00:00:00',
            end_time = '2022-10-20 23:59:59',
            close_time = '2022-10-20 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4405,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-10-14 00:00:00',
            end_time = '2022-10-20 23:59:59',
            close_time = '2022-10-20 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4406,
            title = "每日前往福利商城",
            start_time = '2022-10-14 00:00:00',
            end_time = '2022-10-20 23:59:59',
            close_time = '2022-10-20 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4407,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-10-14 00:00:00',
            end_time = '2022-10-20 23:59:59',
            close_time = '2022-10-20 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},

{
        title = "铃铛豪礼领不停",   
        id = 30410, 
        {
            id = 4400,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-10-07 00:00:00',
            end_time = '2022-10-13 23:59:59',
            close_time = '2022-10-13 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4401,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-10-07 00:00:00',
            end_time = '2022-10-13 23:59:59',
            close_time = '2022-10-13 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4402,
            title = "每日前往福利商城",
            start_time = '2022-10-07 00:00:00',
            end_time = '2022-10-13 23:59:59',
            close_time = '2022-10-13 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4403,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-10-07 00:00:00',
            end_time = '2022-10-13 23:59:59',
            close_time = '2022-10-13 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},






{
        title = "豪礼黄金周",   
        id = 30409, 
        {
            id = 4396,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-09-30 00:00:00',
            end_time = '2022-10-06 23:59:59',
            close_time = '2022-10-06 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4397,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-09-30 00:00:00',
            end_time = '2022-10-06 23:59:59',
            close_time = '2022-10-06 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4398,
            title = "每日前往福利商城",
            start_time = '2022-09-30 00:00:00',
            end_time = '2022-10-06 23:59:59',
            close_time = '2022-10-06 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4399,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-09-30 00:00:00',
            end_time = '2022-10-06 23:59:59',
            close_time = '2022-10-06 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},



{
        title = "铃铛赐福",   
        id = 30408, 
        {
            id = 4392,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-09-23 00:00:00',
            end_time = '2022-09-29 23:59:59',
            close_time = '2022-09-29 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4393,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-09-23 00:00:00',
            end_time = '2022-09-29 23:59:59',
            close_time = '2022-09-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4394,
            title = "每日前往福利商城",
            start_time = '2022-09-23 00:00:00',
            end_time = '2022-09-29 23:59:59',
            close_time = '2022-09-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4395,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-09-23 00:00:00',
            end_time = '2022-09-29 23:59:59',
            close_time = '2022-09-29 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "皮肤装扮福利",
        id = 30358,
 {
            id = 50062,
            title = "拥有柳仙儿装扮可领取-首次获得装扮请等候1小时后重登游戏领取！",
            start_time = '2022-09-15 00:00:00',
            end_time = '2022-09-26 23:59:59',
            close_time = '2022-09-26 23:59:59',
            task_conditions = {
                OwnedSkin = {30}
            },
            gift = {{
                id = 20223,
                num = 1
            }}
        },
},

{ 
        title = "免费看觉醒电影", 
        id = 30361,
                { 
            id = 50067, 
            title = "线上免费看电影《觉醒》，领卡卡妮妮全新限定皮肤！", 
            start_time = '2022-09-23 00:00:00', 
            end_time = '2022-10-09 25:59:59', 
            close_time = '2022-10-09 23:59:59', 
            action = 99, 
            action_txt = '前往查看', 
            action_url="https://i.snssdk.com/magic/eco/runtime/release/62f237d780c3210355e71b82?appType=ixigua&magic_page_no=1&magic_source=pc_minigame&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
apiids='100,101,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
}, 
{ 
        title = "假日时刻福利", 
        id = 30360,
{ 
            id = 50077, 
            title = "假日上QQ小世界看迷你世界，完成任务抽永久皮肤！", 
            start_time = '2022-10-03 00:00:00', 
            end_time = '2022-10-03 25:59:59', 
            close_time = '2022-10-03 23:59:59', 
            action = 99, 
            action_txt = '前往投稿', 
            action_url="https://m.xsj.qq.com/operation/xsj-act/activity/page?id=9b5702b4b59c3b8c856e5c039a2203ae&_wv=1025&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '7,12,13,21,36,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
 { 
            id = 50076, 
            title = "迷你世界X视频号开启迷萌征稿！前往投稿赢大奖！", 
            start_time = '2022-10-03 00:00:00', 
            end_time = '2022-10-03 25:59:59', 
            close_time = '2022-10-03 23:59:59', 
            action = 99, 
            action_txt = '前往投稿', 
            action_url="https://game.weixin.qq.com/cgi-bin/comm/openlink?noticeid=90291182&auth_appid=wxa20b612f1a6b4117&url=https%3A%2F%2Fgame.weixin.qq.com%2Fcgi-bin%2Fh5%2Fstatic%2Fwelfare-task-center%2Ftask_detail.html%3Fappid%3Dwxa20b612f1a6b4117%26actid%3D602863%26wechat_pkgid%3Dwelfare_task_center_task_detail%23wechat_redirect&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '7,12,13,21,36,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
  { 
            id = 50073, 
            title = "来快手打卡新版本视频，记录假日时刻抽装扮！", 
            start_time = '2022-09-30 12:00:00', 
            end_time = '2022-10-04 25:59:59', 
            close_time = '2022-10-04 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url=" https://ppg.viviv.com/doodle/zwCqYdcB.html?uni_src=HYRFTI&hyId=jimu_zwCqYdcB&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '7,12,13,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
{ 
            id = 50074, 
            title = "抖音梦之园假日福利惊喜派送中", 
            start_time = '2022-09-30 12:00:00', 
            end_time = '2022-10-04 25:59:59', 
            close_time = '2022-10-04 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url=" https://aweme.snssdk.com/magic/eco/runtime/release/633142eb6c6d5a036e188764?appType=douyin&magic_page_no=1&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '7,12,13,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
                { 
            id = 50065, 
            title = "线上免费看电影《觉醒》，领卡卡妮妮全新限定皮肤！", 
            start_time = '2022-09-23 00:00:00', 
            end_time = '2022-10-09 25:59:59', 
            close_time = '2022-10-09 23:59:59', 
            action = 99, 
            action_txt = '前往查看', 
            action_url="https://xgfe.snssdk.com/lvfe/activity/goofy/mini/main?enter_from=miniworld&position=channel&hide_back_btn=true&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '21,36,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
}, 
{ 
        title = "大电影送皮肤福利", 
        id = 30346,
{ 
            id = 50045, 
            title = "购买《迷你世界之觉醒》电影票送限定皮肤！", 
            start_time = '2022-08-02 00:00:00', 
            end_time = '2022-09-20 23:59:59', 
            close_time = '2022-09-20 23:59:59', 
            action = 99, 
            action_txt = '立即购票', 
            action_url="https://t.zrfilm.com/miniTheme?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no= '21,36,7',
            --apiids= '1,110,69,96,92,94,65,74,80,112,50,67,78,71,113,84,95,73,82,70,83,77,90,49,10,999',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
                { 
            id = 50039, 
            title = "玩觉醒，超多福利等你拿！", 
            start_time = '2022-07-28 10:00:00', 
            end_time = '2022-08-14 23:59:59', 
            close_time = '2022-08-14 23:59:59', 
            action = 75, 
            action_txt = '立即前往', 
            --action_url="75", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.16.0",
            --apiids = '999,1',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 { 
            id = 50043, 
            title = "看电影发布会赢永久装扮和盲盒周边！", 
            start_time = '2022-07-29 14:00:00', 
            end_time = '2022-07-29 23:59:59', 
            close_time = '2022-07-29 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1 ", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no = '52,7,12,13,21,36,35,74,19,94,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',},
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },


{
        title = "金蛋赐豪礼",   
        id = 30407, 
        {
            id = 4388,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-09-16 00:00:00',
            end_time = '2022-09-22 23:59:59',
            close_time = '2022-09-22 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4389,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-09-16 00:00:00',
            end_time = '2022-09-22 23:59:59',
            close_time = '2022-09-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4390,
            title = "每日前往福利商城",
            start_time = '2022-09-16 00:00:00',
            end_time = '2022-09-22 23:59:59',
            close_time = '2022-09-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4391,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-09-16 00:00:00',
            end_time = '2022-09-22 23:59:59',
            close_time = '2022-09-22 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "铃铛豪礼季",   
        id = 30406, 
        {
            id = 4384,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-09-09 00:00:00',
            end_time = '2022-09-15 23:59:59',
            close_time = '2022-09-15 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4385,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-09-09 00:00:00',
            end_time = '2022-09-15 23:59:59',
            close_time = '2022-09-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4386,
            title = "每日前往福利商城",
            start_time = '2022-09-09 00:00:00',
            end_time = '2022-09-15 23:59:59',
            close_time = '2022-09-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4387,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-09-09 00:00:00',
            end_time = '2022-09-15 23:59:59',
            close_time = '2022-09-15 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},

{
        title = "豪礼金蛋福利",   
        id = 30405, 
        {
            id = 4380,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-09-02 00:00:00',
            end_time = '2022-09-08 23:59:59',
            close_time = '2022-09-08 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4381,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-09-02 00:00:00',
            end_time = '2022-09-08 23:59:59',
            close_time = '2022-09-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4382,
            title = "每日前往福利商城",
            start_time = '2022-09-02 00:00:00',
            end_time = '2022-09-08 23:59:59',
            close_time = '2022-09-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4383,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-09-02 00:00:00',
            end_time = '2022-09-08 23:59:59',
            close_time = '2022-09-08 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},

{
        title = "铃铛响响拿豪礼",   
        id = 30404, 
        {
            id = 4376,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-08-26 00:00:00',
            end_time = '2022-09-01 23:59:59',
            close_time = '2022-09-01 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4377,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-08-26 00:00:00',
            end_time = '2022-09-01 23:59:59',
            close_time = '2022-09-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4378,
            title = "每日前往福利商城",
            start_time = '2022-08-26 00:00:00',
            end_time = '2022-09-01 23:59:59',
            close_time = '2022-09-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4379,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-08-26 00:00:00',
            end_time = '2022-09-01 23:59:59',
            close_time = '2022-09-01 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "铃铛赠礼",   
        id = 30403, 
        {
            id = 4373,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-08-19 00:00:00',
            end_time = '2022-08-25 23:59:59',
            close_time = '2022-08-25 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4374,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-08-19 00:00:00',
            end_time = '2022-08-25 23:59:59',
            close_time = '2022-08-25 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4375,
            title = "每日前往福利商城",
            start_time = '2022-08-19 00:00:00',
            end_time = '2022-08-25 23:59:59',
            close_time = '2022-08-25 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4376,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-08-19 00:00:00',
            end_time = '2022-08-25 23:59:59',
            close_time = '2022-08-25 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "金蛋得豪礼",   
        id = 30402, 
        {
            id = 4369,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-08-12 00:00:00',
            end_time = '2022-08-18 23:59:59',
            close_time = '2022-08-18 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4370,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-08-12 00:00:00',
            end_time = '2022-08-18 23:59:59',
            close_time = '2022-08-18 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4371,
            title = "每日前往福利商城",
            start_time = '2022-08-12 00:00:00',
            end_time = '2022-08-18 23:59:59',
            close_time = '2022-08-18 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4372,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-08-12 00:00:00',
            end_time = '2022-08-18 23:59:59',
            close_time = '2022-08-18 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},



{ 
        title = "新装扮上线", 
        id = 30350,
                { 
            id = 50048, 
            title = "新伙伴喵菲和妮姆抢先登场！快来一起做客梦幻岛吧！", 
            start_time = '2022-08-10 11:00:00', 
            end_time = '2022-08-14 23:59:59', 
            close_time = '2022-08-14 23:59:59', 
            action = 80, 
            action_txt = '立即前往', 
            --action_url="28", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.16.0",
            apiids = '999',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 
 }, 

{ 
        title = "沙漠冒险福利", 
        id = 30347,
                { 
            id = 50040, 
            title = "神秘遗迹、沙海绿洲等你冒险！", 
            start_time = '2022-07-28 10:00:00', 
            end_time = '2022-08-31 23:59:59', 
            close_time = '2022-08-31 23:59:59', 
            action = 28, 
            action_txt = '前往冒险', 
            --action_url="28", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.16.0",
            --apiids = '999,1',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
{ 
            id = 50044, 
            title = "最新沙漠版本攻略介绍、趣味玩法、沙漠福利，来快手视频探索吧！", 
            start_time = '2022-07-30 09:00:00', 
            end_time = '2022-08-03 23:59:59', 
            close_time = '2022-08-03 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
           apiids = '1,110',
            --apiids_no = '52,7,12,13,21,36,2,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
{ 
            id = 50041, 
            title = "风暴来袭！看精彩沙漠视频，抽限定装扮礼物！", 
            start_time = '2022-07-29 14:00:00', 
            end_time = '2022-07-31 23:59:59', 
            close_time = '2022-07-31 23:00:00', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://aweme.snssdk.com/magic/eco/runtime/release/62df632c364368034f6143e2?appType=douyin&title_color=ffffff&nav_bar_color=000000&status_bar_color=000000&magic_page_no=1&start_page=magic-pages%2Fcomp93utqb8o62ei%2Findex&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no = '52,7,12,13,21,36,2',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
  { 
            id = 50042, 
            title = "观看与投稿沙漠视频，抽探索大礼包！", 
            start_time = '2022-07-29 14:00:00', 
            end_time = '2022-08-01 23:59:59', 
            close_time = '2022-08-01 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://i.snssdk.com/magic/eco/runtime/release/62cfdea9415205033e3eb95b?appType=ixigua&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no = '52,7,12,13,21,36,2,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
{ 
            id = 50056,  
            title ="来虎牙看主播挑战沙漠生存，抽风暴礼包！", 
            start_time = '2022-08-26 23:00:00', 
            end_time = '2022-08-28 23:59:59', 
            close_time = '2022-08-28 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://hd.huya.com/huyaDIYzt/24521/mobile/index.html?wxShare=1&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no = '52,12,13,7,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{ 
        title = "迷你联萌动画福利", 
        id = 30353,
                { 
            id = 50053, 
            title = "观看《迷你联萌》动画，了解你不知道的小镇那些事儿。", 
            start_time = '2022-08-22 12:00:00', 
            end_time = '2022-09-04 23:59:59', 
            close_time = '2022-09-04 23:59:59', 
            action = 99, 
            action_txt = '前往观看', 
            action_url="https://www.ixigua.com/7117233481653944868?id=7119813648100360712&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.17.0",
            apiids_no = '52,12,13,7,21,36,45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{ 
        title = "创作领福利", 
        id = 30356,
                { 
            id = 50057, 
            title = "来快手看视频发作品，领海量福利！", 
            start_time = '2022-09-03 00:00:00', 
            end_time = '2022-09-07 23:59:59', 
            close_time = '2022-09-07 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            apiids_no = '52,7,12,13,21,36,35,19,94',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
    },
{ 
        title = "微博超话送大礼", 
        id = 30355,
                { 
            id = 50055, 
            title = "来微博超话福利中心参与互动，永久装扮带回家！", 
            start_time = '2022-08-26 00:00:00', 
            end_time = '2022-08-28 23:59:59', 
            close_time = '2022-08-28 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="sinaweibo://pageinfo?containerid=100808baecf17ac680463795ea5e91e07bd392&extparam=%E8%BF%B7%E4%BD%A0%E4%B8%96%E7%95%8C&luicode=10000360&lfid=OP_329009728&launchid=10000360-OP_329009728&openBrowser=1", 
jump_app = "fx_wb", --fx_qq,fx_qqkj,fx_wx,fx_pyq,fx_wb,  
url_ext = "https://weibo.com/p/100808baecf17ac680463795ea5e91e07bd392?&luicode=10000360&lfid=OP_329009728&launchid=10000360-OP_329009728&wm=90314_90001&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            apiids_no = '52,7,12,13,21,36',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
    },
{ 
        title = "视频创作赛", 
        id = 30354,
                { 
            id = 50054, 
            title = "参与视频投稿，瓜分15万DOU+与万元京东卡奖励！", 
            start_time = '2022-08-23 15:00:00', 
            end_time = '2022-08-25 23:59:59', 
            close_time = '2022-08-25 23:59:59', 
            action = 99, 
            action_txt = '前往观看',          action_url="https://bbci.magich5page.com/magic/eco/runtime/release/62fcd4dcfc01800371972ed6?appType=douyin&magic_source=wechat&magic_page_no=1&start_page=magic-pages%2Fcomps9ahl4x292js%2Findex&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.17.0",
            apiids_no = '52,7,12,13,21,36,45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{
        title = "斗罗活动福利", 
        id = 30343, 
{ 
            id =  50023, 
            title = "迷你斗罗活动开放，免费皮肤等你拿！", 
            start_time = '2022-07-08 10:00:00', 
            end_time = '2022-08-31 23:59:59', 
            close_time = '2022-08-31 23:59:59',  
            action = 70, 
            action_txt = '立即前往 ', 
            --action_url ="https://merch.szx.abchina.com/wbank/html/openRoutine.html?path=/activePages/pages/active/index&page=mnsjnhspf&networkCode=410233", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.15.0",
           --apiids = '1,110',     
            },
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12851, num =1  }, 
            }, 
        }, 
{ 
            id = 50025, 
            title = "斗罗主题抽奖限时上线，看我一发入魂！", 
            start_time = '2022-07-08 10:00:00', 
            end_time = '2022-08-14 23:59:59', 
            close_time = '2022-08-14 23:59:59',  
            action = 99, 
            action_txt = '立即前往 ', 
            action_url ="s4_https://h5.mini1.cn/actp/205145342934704128?channel=1&portrait=2&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.15.0",
           --apiids = '1,110',
            },
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12851, num =1  }, 
            }, 
        }, 
{ 
            id = 50032, 
            title = "来抖音看斗罗视频抽免费马红俊和定制装扮！", 
            start_time = '2022-07-15 18:00:00', 
            end_time = '2022-07-18 23:59:59', 
            close_time = '2022-07-18 23:59:59',  
            action = 99, 
            action_txt = '前往参与 ',          action_url="https://aweme.snssdk.com/magic/eco/runtime/release/62cbcf01884b630350fc3709?appType=douyin&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.15.0",
           --apiids = '1,110',             apiids_no="12,13,7,21,36,17,55,10,49,28,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
            },
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12851, num =1  }, 
            }, 
        }, 
{ 
            id = 50033, 
            title = "全区最强抖音主播齐聚PK，精彩福利等你来抽！", 
            start_time = '2022-07-14 18:00:00', 
            end_time = '2022-07-14 23:59:59', 
            close_time = '2022-07-14 23:59:59',  
            action = 99, 
            action_txt = '前往参与 ',          
action_url="https://lf3-cdn-tos.bytescm.com/obj/magic-cn/magic_eco_62c6d20356cba0056576ad70.html?__live_platform__=webcast&activity=op_component-open-4-7117596854048560158&web_bg_color=%23ffffffff&from_feed=true&hide_nav_bar=1&hide_status_bar=1&show_back=1&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.15.0",
           --apiids = '1,110',               apiids_no="12,13,7,21,36,17,55,10,49,28,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
            },
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12851, num =1  }, 
            }, 
        }, 
{ 
            id = 50034, 
            title = "参与西瓜斗罗视频活动，抽免费斗罗皮肤马红俊！", 
            start_time = '2022-07-15 18:00:00', 
            end_time = '2022-07-18 23:59:59', 
            close_time = '2022-07-18 23:59:59',  
            action = 99, 
            action_txt = '前往参与 ',          
action_url="https://i.snssdk.com/magic/eco/runtime/release/62cfdea9415205033e3eb95b?appType=ixigua&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.15.0",
           --apiids = '1,110',           apiids_no="12,13,7,21,36,17,55,10,49,28,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
            },
            task_conditions = { 
                login_day = 0,   }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0,   },
            gift = { 
                { id =12851, num =1  }, 
            }, 
        }, 
},
{ 
        title = "助力西瓜play", 
        id = 30348,
                { 
            id =50046, 
            title = "西瓜play嘉年华，助力迷你世界主播刘半仙解说，为迷你加油！", 
            start_time = '2022-08-02 16:00:00', 
            end_time = '2022-08-04 23:59:59', 
            close_time = '2022-08-04 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url="https://v.ixigua.com/2vosgP2/?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            --apiids = '1,110',   
            apiids_no = "2,121,52,12,13,21,7,36,100,101,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12855, num = 1 }, 
            }, 
        }, 
 }, 
{ 
        title = "花小楼新歌福利", 
        id = 30351,
{ 
            id = 50052, 
            title = "来QQ音乐观看花小楼直播，新歌福利带回家！", 
            start_time = '2022-08-18 00:00:00', 
            end_time = '2022-08-19 20:59:59', 
            close_time = '2022-08-19 20:59:59', 
            action = 99, 
            action_txt = '观看直播', 
            action_url="https://v.y.qq.com/m/client/basic/mid.html?target=liveshow&encryptUin=owSz7iCA7e65oz**&fromtag=push_yunying&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no= '52,12,13,7,21,36,28,57',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            },
},
                { 
            id = 50050, 
            title = "听花小楼新歌赢盲盒与永久装扮！", 
            start_time = '2022-08-16 14:00:00', 
            end_time = '2022-08-18 23:59:59', 
            close_time = '2022-08-18 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url="https://y.qq.com/jzt/271ddc/c4b05f.html?jztid=2014&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.16.0",
            apiids_no= '52,12,13,7,21,36,28,57',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },

{ 
        title = "花小楼夏日巨献", 
        id = 30345,
                { 
            id = 50031, 
            title = "看花小楼直播赢永久装扮和盲盒周边！", 
            start_time = '2022-07-15 17:00:00', 
            end_time = '2022-07-22 23:59:59', 
            close_time = '2022-07-22 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://ppg.viviv.com/doodle/japmYOXX.html?hyId=jimu_japmYOXX&&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            apiids_no="52,7,12,13,21,36,2,45", 
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{ 
        title = "小马宝莉盲盒", 
        id = 30364,
 { 
            id =50082, 
            title = "MINI少女团小马宝莉盲盒，隐藏款送宇宙公主游戏皮肤！", 
            start_time = '2022-11-01 00:00:00', 
            end_time = '2022-11-31 23:59:59', 
            close_time = '2022-11-31 23:59:59', 
            action =99, 
            action_txt = '立即查看', 
            action_url = "https://detail.tmall.com/item.htm?id=684769341446&sku_properties=134942334:28383&openBrowser=1",
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
           apiids_no="97,58,7,12,13,21,36,2,121",
            },
            task_conditions = { 
                login_day = 0, }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12963, num = 1 }, 
            }, 
        }, 
                { 
            id =50083, 
            title = "盲盒专区端盒  +1元换购花小楼大体手办！", 
            start_time = '2022-11-01 00:00:00', 
            end_time = '2022-11-11 23:59:59', 
            close_time = '2022-11-11 23:59:59', 
            action =99, 
            action_txt = '立即换购', 
            action_url = "https://detail.tmall.com/item_o.htm?spm=a21dvs.23580594.0.0.6ae53d0dsUFx0v&spm=a2141.7631564.1999019700&releaseId=318828&bucketId=447258&id=690010645139&sku_properties=134942334:28383&scm=20140620.6.1&isvItem=669231858973&openBrowser=1",
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
           apiids_no="7,12,13,21,36,45,15,49,65,78,28,83,74,67,71",
            },
            task_conditions = { 
                login_day = 0, }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12963, num = 1 }, 
            }, 
        }, 
     { 
            id =50071, 
            title = "迷你抽盒机宠粉中，海量爆款盲盒229元即可端盒～", 
            start_time = '2022-09-30 00:00:00', 
            end_time = '2022-10-31 23:59:59', 
            close_time = '2022-10-31 23:59:59', 
            action =99, 
            action_txt = '立即开盒', 
            action_url = "https://mall.miniworldstory.com/?portrait=1&openBrowser=3",
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
           apiids_no="7,12,13,21,36,28",
           --apiids="1,110,69,96,92,94,65,74,80,112,50,67,78,71,113,84,95,73,82,70,83,77,90,49,10,999",
            },
            task_conditions = { 
                login_day = 0, }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12851, num = 1 }, 
            }, 
        }, 
 }, 

    
{
        title = "夏日铃铛狂欢周",   
        id = 30399, 
        {
            id = 4357,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-07-22 00:00:00',
            end_time = '2022-07-28 23:59:59',
            close_time = '2022-07-28 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4358,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-07-22 00:00:00',
            end_time = '2022-07-28 23:59:59',
            close_time = '2022-07-28 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4359,
            title = "每日前往福利商城",
            start_time = '2022-07-22 00:00:00',
            end_time = '2022-07-28 23:59:59',
            close_time = '2022-07-28 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4360,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-07-22 00:00:00',
            end_time = '2022-07-28 23:59:59',
            close_time = '2022-07-28 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "福气金蛋",   
        id = 30400, 
        {
            id = 4361,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-07-29 00:00:00',
            end_time = '2022-08-04 23:59:59',
            close_time = '2022-08-04 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4362,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-07-29 00:00:00',
            end_time = '2022-08-04 23:59:59',
            close_time = '2022-08-04 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4363,
            title = "每日前往福利商城",
            start_time = '2022-07-29 00:00:00',
            end_time = '2022-08-04 23:59:59',
            close_time = '2022-08-04 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4364,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-07-29 00:00:00',
            end_time = '2022-08-04 23:59:59',
            close_time = '2022-08-04 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},

{
        title = "夏日金蛋福利",   
        id = 30398, 
        {
            id = 4353,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-07-15 00:00:00',
            end_time = '2022-07-21 23:59:59',
            close_time = '2022-07-21 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids =  '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4354,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-07-15 00:00:00',
            end_time = '2022-07-21 23:59:59',
            close_time = '2022-07-21 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4355,
            title = "每日前往福利商城",
            start_time = '2022-07-15 00:00:00',
            end_time = '2022-07-21 23:59:59',
            close_time = '2022-07-21 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4356,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-07-15 00:00:00',
            end_time = '2022-07-21 23:59:59',
            close_time = '2022-07-21 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "铃铛响响得豪礼",   
        id = 30397, 
        {
            id = 4349,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-07-08 00:00:00',
            end_time = '2022-07-14 23:59:59',
            close_time = '2022-07-14 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4350,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-07-08 00:00:00',
            end_time = '2022-07-14 23:59:59',
            close_time = '2022-07-14 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4351,
            title = "每日前往福利商城",
            start_time = '2022-07-08 00:00:00',
            end_time = '2022-07-14 23:59:59',
            close_time = '2022-07-14 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4352,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-07-08 00:00:00',
            end_time = '2022-07-14 23:59:59',
            close_time = '2022-07-14 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "初夏金蛋福利",   
        id = 30396, 
        {
            id = 4345,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-07-01 00:00:00',
            end_time = '2022-07-07 23:59:59',
            close_time = '2022-07-07 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4346,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-07-01 00:00:00',
            end_time = '2022-07-07 23:59:59',
            close_time = '2022-07-07 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4347,
            title = "每日前往福利商城",
            start_time = '2022-07-01 00:00:00',
            end_time = '2022-07-07 23:59:59',
            close_time = '2022-07-07 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4348,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-07-01 00:00:00',
            end_time = '2022-07-07 23:59:59',
            close_time = '2022-07-07 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{ 
        title = "微博测试", 
        id = 30339,
                { 
            id = 50017, 
            title = "家园保卫战PVE塔防主题训练营，边学边做，投稿赢大奖！", 
            start_time = '2022-06-16 17:00:00', 
            end_time = '2022-07-01 23:59:59', 
            close_time = '2022-07-01 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url="sinaweibo://searchall?luicode=10000360&lfid=OP_329009728&launchid=10000360-OP_329009728&q=%23%E8%BF%B7%E4%BD%A0%E7%81%B5%E7%8B%90%E9%85%8D%E9%9F%B3%E8%B5%9B%23", 
jump_app = "fx_wb", --fx_qq,fx_qqkj,fx_wx,fx_pyq,fx_wb,  
url_ext = "https://www.mini1.cn/", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            apiids = '999',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{
        title = "铃铛福利",   
        id = 30395, 
        {
            id = 4341,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-06-24 00:00:00',
            end_time = '2022-06-30 23:59:59',
            close_time = '2022-06-30 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4342,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-06-24 00:00:00',
            end_time = '2022-06-30 23:59:59',
            close_time = '2022-06-30 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4343,
            title = "每日前往福利商城",
            start_time = '2022-06-24 00:00:00',
            end_time = '2022-06-30 23:59:59',
            close_time = '2022-06-30 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4344,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-06-24 00:00:00',
            end_time = '2022-06-30 23:59:59',
            close_time = '2022-06-30 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},




{
        title = "兑金蛋拿豪礼",   
        id = 30394, 
        {
            id = 4337,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-06-17 00:00:00',
            end_time = '2022-06-23 23:59:59',
            close_time = '2022-06-23 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4338,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-06-17 00:00:00',
            end_time = '2022-06-23 23:59:59',
            close_time = '2022-06-23 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4339,
            title = "每日前往福利商城",
            start_time = '2022-06-17 00:00:00',
            end_time = '2022-06-23 23:59:59',
            close_time = '2022-06-23 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4340,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-06-17 00:00:00',
            end_time = '2022-06-23 23:59:59',
            close_time = '2022-06-23 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},


{
        title = "狂欢夏日领豪礼",   
        id = 30393, 
        {
            id = 4333,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-06-10 00:00:00',
            end_time = '2022-06-16 23:59:59',
            close_time = '2022-06-16 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4334,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-06-10 00:00:00',
            end_time = '2022-06-16 23:59:59',
            close_time = '2022-06-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4335,
            title = "每日前往福利商城",
            start_time = '2022-06-10 00:00:00',
            end_time = '2022-06-16 23:59:59',
            close_time = '2022-06-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4336,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-06-10 00:00:00',
            end_time = '2022-06-16 23:59:59',
            close_time = '2022-06-16 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},


{
        title = "夏日金蛋送豪礼",   
        id = 30392, 
        {
            id = 4329,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-06-03 00:00:00',
            end_time = '2022-06-09 23:59:59',
            close_time = '2022-06-09 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4330,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-06-03 00:00:00',
            end_time = '2022-06-09 23:59:59',
            close_time = '2022-06-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4331,
            title = "每日前往福利商城",
            start_time = '2022-06-03 00:00:00',
            end_time = '2022-06-09 23:59:59',
            close_time = '2022-06-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4332,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-06-03 00:00:00',
            end_time = '2022-06-09 23:59:59',
            close_time = '2022-06-09 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},

{ 
        title = "端午节福利", 
        id = 30339,
                { 
            id = 50010, 
            title = "快来端午民俗村包粽子、打水仗、赛龙舟啦！", 
            start_time = '2022-06-01 18:00:00', 
            end_time = '2022-06-19 23:59:59', 
            close_time = '2022-06-19 23:59:59', 
            action = 75, 
            action_txt = '立即前往', 
           --action_url="s4_https://sso.mini1.cn/#/transit?url=https://h5.mini1.cn/act/c5m/my2021/&portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.13.0",
                --apiids_no = '45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
{ 
            id = 50012, 
            title = "来快手粽夏一下，做任务抽取超多精彩福利！", 
            start_time = '2022-06-02 00:00:00', 
            end_time = '2022-06-05 23:59:59', 
            close_time = '2022-06-05 23:59:59', 
            action = 99, 
            action_txt = '前往参与', 
            action_url="https://ppg.viviv.com/doodle/qgCKweFS.html?hyId=jimu_qgCKweFS&entry_src=callback_ios_bm_ba_yxstnryy_nset_miniios&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            apiids_no="52,7,12,13,21,36",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },
{
        title = "铃铛大礼欢乐送",   
        id = 30391, 
        {
            id = 4325,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-05-27 00:00:00',
            end_time = '2022-06-02 23:59:59',
            close_time = '2022-06-02 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4326,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-05-27 00:00:00',
            end_time = '2022-06-02 23:59:59',
            close_time = '2022-06-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4327,
            title = "每日前往福利商城",
            start_time = '2022-05-27 00:00:00',
            end_time = '2022-06-02 23:59:59',
            close_time = '2022-06-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 10 },
            },

        },

        {
            id = 4328,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-05-27 00:00:00',
            end_time = '2022-06-02 23:59:59',
            close_time = '2022-06-02 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10018, num = 5 },
            },

        },
},



{
        title = "福气金蛋",   
        id = 30390, 
        {
            id = 4321,
            title = "每日观看广告拿多重豪礼！每日可领取25次噢~",
            start_time = '2022-05-20 00:00:00',
            end_time = '2022-05-26 23:59:59',
            close_time = '2022-05-26 23:59:59',
            conditions = {
                version_min = "0.47.5",
				apiids='1',
                --apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 25, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },
       {
            id = 4322,
            title = "每日前往商店看15条迷你点广告，重启游戏获取奖励",
            start_time = '2022-05-20 00:00:00',
            end_time = '2022-05-26 23:59:59',
            close_time = '2022-05-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
				
                apiids='1',
                --apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
               ad_total = 15,
            },
            action = 33,
            action_txt = '点击前往',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 50 },
                { id =10054, num = 2 },
            },

        },

        {
            id = 4323,
            title = "每日前往福利商城",
            start_time = '2022-05-20 00:00:00',
            end_time = '2022-05-26 23:59:59',
            close_time = '2022-05-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
				
               apiids='1',
                --apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 10 },
            },

        },

        {
            id = 4324,
            title = "每日前往幸运盲盒，免费获取福利奖励",
            start_time = '2022-05-20 00:00:00',
            end_time = '2022-05-26 23:59:59',
            close_time = '2022-05-26 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
				
                apiids='1',
                --apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,57,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 50,
            action_txt = '前往查看',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
	{ id =10019, num = 5 },
            },

        },
},
 {
        title = "皮肤装扮福利",
        id = 303780,
 {
            id = 42820,
            title = "拥有绮梦灵狐·华阳装扮-首次获得装扮请等候1小时后重登游戏领取",
            start_time = '2022-05-31 10:00:00',
            end_time = '2022-07-15 23:59:59',
            close_time = '2022-07-15 23:59:59',
            conditions = {
                version_min = "1.13.0"
            },
            task_conditions = {
                OwnedSkin = {230}
            },
            gift = {{
                id = 33076,
                num = 1
            }}
        },
},
{
        title = "会员派对",
        id = 30341,
 {
            id = 50019,
            title = "参与即得会员体验机会，畅享各大会员特权。快来参加吧！",
            start_time = '2022-06-29 14:00:00',
            end_time = '2022-07-31 23:59:59',
            close_time = '2022-07-31 23:59:59',
            action =1005, 
            action_txt = '立即参与',
            need_press_action = 1, 
            conditions = {
                version_min = "1.15.0"
            },
            task_conditions = {
                login_day = 0, 
            },
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 },
            gift = {
               {id = 12851,num = 1 }, 
 }, 
        },
},


{
        title = "家园福利",
        id = 30359,

  {
            id = 4135,
            title = "前往家园给好友浇水",
            start_time = '2021-01-01 10:00:00', 
            end_time = '2023-12-31 23:59:59', 
            close_time = '2023-12-31 23:59:59', 
            conditions = {
                version_min = "0.35.0",
            },
            task_conditions = {
                water = 1,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0,
            },
            action = 6,
            action_txt = '前往家园',
          need_press_action = 1, --点击前往按钮后，才能领取奖励
            gift = {
                { id = 24807, num = 3 },
            },
        },
     {
            id = 4136,
            title = "收获一次金果实--完成后重新登录游戏领取",
            start_time = '2021-01-01 10:00:00', 
            end_time = '2023-12-31 23:59:59', 
            close_time = '2023-12-31 23:59:59', 
            conditions = {
                apiids_no = '9999',
            },
            task_conditions = {
                           cj288 = 1,
            },
             repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0,
            },
            action = 6,
            action_txt = '前往家园',
           need_press_action = 1, --点击前往按钮后，才能领取奖励
            gift = {
                { id = 24807, num = 5 },
                { id = 12851, num = 1 },
            },
        },
             {
            id = 4137,
            title = "完成一次十连收获金果实--完成后重新登录游戏领取",
            start_time = '2021-01-01 10:00:00', 
            end_time = '2023-12-31 23:59:59', 
            close_time = '2023-12-31 23:59:59', 
            conditions = {
                apiids_no = '9999',
            },
            task_conditions = {
                           cj2880 = 1,
            },
             repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0,
            },
            action = 6,
            action_txt = '前往家园',
           need_press_action = 1, --点击前往按钮后，才能领取奖励
            gift = {
                { id = 24807, num = 30 },
                { id = 12851, num = 1 },
            },
        },
    },

{ 
        title = "迷你福利仓", 
        id = 30338, 

            { 
            id = 4223, 
            title = "回归福利（30天以上未登录玩家）", 
            start_time = '2022-01-21 10:00:00', 
            end_time = '2022-02-15 22:59:59', 
            close_time = '2022-02-15 22:59:59',     
            conditions = {
                version_min = "1.09.0",
                apiids_no =  "9999",
            },
            task_conditions = { 
                unlogin_days = 30,
            }, 
            gift = { 
                { id = 10000, num = 66 }, 
                { id = 24805, num = 20 }, 
                { id = 12961, num = 1 }, 
                { id = 12851, num = 1 }, 
            }, 
        }, 


        {
            id = 3231,
            title = "每日领取小草块",
            start_time = '2018-01-01 00:00:00',
            end_time = '2023-12-31 23:59:59',
            close_time = '2023-12-31 23:59:59',
            hide_red_mark=1,
            task_conditions = {
                login_day = 0,
            },

            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 10000, --最多领100次
                gift_add_up = 0,
            },
            gift = {
                { id = 10005, num = 1 },
            },

        },

        {
            id = 20191207,
            title = "周六福利-每周一次哦！",
            start_time = '2018-01-01 00:00:00',
            end_time = '2023-12-31 23:59:59',
            close_time = '2023-12-31 23:59:59',
            hide_red_mark=1,
            task_conditions = {
                week_day = 6,
            },
            repeat_task = {
                cd = 6, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0,
            },
            gift = {
                { id = 12851, num = 1 },
                { id = 20035, num = 5 },
            },

        },

        {
            id = 20191208,
            title = "周日福利-每周一次哦！",
            start_time = '2018-01-01 00:00:00',
            end_time = '2023-12-31 23:59:59',
            close_time = '2023-12-31 23:59:59',
            hide_red_mark=1,
            task_conditions = {
                week_day = 7,
            },
            repeat_task = {
                cd = 6, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0,
            },
            gift = {
                { id = 12851, num = 1 },
                { id = 20035, num = 5 },
            },

        },

    },  
  



{   
        title = "花小楼的新花样",   
        id = 30315,   
            { 
            id = 4019, 
            title = "新年新花样，一起玩花小楼全新数字专辑互动场景", 
            start_time = '2022-02-18 12:00:00', 
            end_time = '2022-02-20 22:59:59', 
            close_time = '2022-02-20 22:59:59', 
            action = 99, 
            action_txt = '前往任务', 
            action_url = "https://hd.huya.com/huyaDIYzt/21465/mobile/index.html?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            task_conditions = { 
                login_day = 0, 
            }, 
            conditions = {
               apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,52,13,36,7,12,21',},
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
            { 
            id = 4094, 
            title = "花小楼、双马尾PK玩音乐，福利预热抢鲜看", 
            start_time = '2021-12-17 19:30:00', 
            end_time = '2021-12-27 22:59:59', 
            close_time = '2021-12-27 22:59:59', 
            action = 99, 
            action_txt = '点击观看', 
            action_url = "https://zt.huya.com/20399/pc/index.html?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            task_conditions = { 
                login_day = 0, 
            }, 
            conditions = {
                apiids = '109,101,102,122,124,125,121,123,127,126,110,100,128,129',
                 },
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
            { 
            id = 4058, 
            title = "迷你星球预告片抢鲜看", 
            start_time = '2021-12-25 23:00:00', 
            end_time = '2021-12-31 22:59:59', 
            close_time = '2021-12-31 22:59:59', 
            action = 99, 
            action_txt = '前往发布', 
            action_url = "https://live.qq.com/api/douyu?execType=40&scode=ALDbpe5DpbjA&qrtype=9&chc=ALDbpe5DpbjA&ct=ALDbpe5DpbjA&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            task_conditions = { 
                login_day = 0, 
            }, 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5',
                 },
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
            { 
            id = 4059, 
            title = "音“跃”指尖！先抢看音乐新版本抽福利大奖", 
            start_time = '2021-12-05 10:00:00', 
            end_time = '2021-12-05 22:59:59', 
            close_time = '2021-12-05 22:59:59', 
            action = 99, 
            action_txt = '点击参加', 
            action_url = "https://static.iqiyi.com/qyh-activity/minidraw.html?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            task_conditions = { 
                login_day = 0, 
            }, 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5',
                 },
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 

      },

   
        {
        title = "新装扮上线！",
        id = 30367,
            { 
            id = 4217, 
            title = "来自白金铃兰的守护，快来参与抽奖吧！", 
            start_time = '2022-04-29 10:00:00', 
            end_time = '2022-05-15 22:59:59', 
            close_time = '2022-05-15 22:59:59', 
            action = 99, 
            action_txt = '立即参与', 
            action_url = "s4_https://h5.mini1.cn/actp/180489557688639488?channel=1&openBrowser=3&portrait=2", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.12.0",
                 --apiids =  "1,110",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 
        { 
            id = 4218, 
            title = "银铃携手彩俐公主换装全新上线！快来选购吧！", 
            start_time = '2022-04-29 10:00:00', 
            end_time = '2022-04-31 22:59:59', 
            close_time = '2022-04-31 22:59:59', 
            action = 99, 
            action_txt = '立即选购', 
            action_url = "s4_https://h5.mini1.cn/actp/180600771177537536?channel=1&openBrowser=3&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.12.0",
                 apiids_no =  "52",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 
     },

    {
        title = "春日幸运礼",
        id = 30366,
                { 
            id = 4215, 
            title = "早春来临，幸运齐聚，快来收集你的春日幸运吧！", 
            start_time = '2022-03-01 10:00:00', 
            end_time = '2021-03-31 22:59:59', 
            close_time = '2021-03-31 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://mall.mini1.cn/pages/rLogin/rLogin?id=1x5YdNuLmYQ=%3D&openBrowser=1&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.09.0",
                 --apiids =  "1,110",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 
        { 
            id = 4216, 
            title = "参与获得收集许愿卡，解锁活动限定坐骑“水云游”！", 
            start_time = '2022-01-19 10:00:00', 
            end_time = '2022-02-28 22:59:59', 
            close_time = '2022-02-28 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://sso.mini1.cn/#/transit?url=https%3A%2F%2Fh5.mini1.cn%2Fact%2Fc5m%2Flattice%2F&openBrowser=3&portrait=2", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.09.0",
                 --apiids =  "1,110",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 
            { 
            id = 4016, 
            title = "福虎送礼，签到领奖,、千份盲盒等你抽！", 
            start_time = '2022-01-31 10:00:00', 
            end_time = '2022-02-09 23:59:59', 
            close_time = '2022-02-09 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://sso.mini1.cn/#/transit?url=https%3A%2F%2Fh5.mini1.cn%2Fact%2Fc5m%2Ffestival-promote%2F%23%2Fhome&openBrowser=1&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129',
                 },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 

           { 
            id = 4203, 
            title = "邀请好友齐开通会员，领豪华拼团礼包", 
            start_time = '2022-01-05 10:00:00', 
            end_time = '2022-02-15 22:59:59', 
            close_time = '2022-02-15 22:59:59', 
            action = 99, 
            action_txt = '前往拼团', 
            action_url = "s4_https://sso.mini1.cn/#/transit?url=https%3A%2F%2Fh5.mini1.cn%2Fact%2Fc5m%2Ffestival-member%2F&openBrowser=3&portrait=2", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.09.0",
				apiids_no =  "9999",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 20038, num = 1 }, 
            }, 
        }, 

    },

    {
        title = "皮肤装扮福利",
        id = 30378,
 {
            id = 4282,
            title = "拥有齐天小圣装扮-首次获得装扮请等候1小时后重登游戏领取",
            start_time = '2022-03-07 10:00:00',
            end_time = '2022-03-13 23:59:59',
            close_time = '2022-03-13 23:59:59',
            conditions = {
                version_min = "0.48.0"
            },
            task_conditions = {
                OwnedSkin = {2}
            },
            gift = {{
                id = 20254,
                num = 1
            }}
        },
        {
            id = 4283,
            title = "拥有二郎神装扮-首次获得装扮请等候1小时后重登游戏领取",
            start_time = '2022-03-07 10:00:00',
            end_time = '2022-03-13 23:59:59',
            close_time = '2022-03-13 23:59:59',
            conditions = {
                version_min = "0.52.0"
            },
            task_conditions = {
                OwnedSkin = {25}
            },
            gift = {{
                id = 20214,
                num = 1,
            }}
        },
},



{
        title = "武器皮肤体验包",   
        id = 30355, 

       {
            id = 4187,
            title = "前往武器皮肤商店，限时体验全新武器皮肤",
            start_time = '2021-12-15 00:00:00',
            end_time = '2021-12-19 23:59:59',
            close_time = '2021-12-19 23:59:59',
			hide = 1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "1.8.0",
				--apiids='1,110,13,999',
            },

            task_conditions = {
               login_day = 0,
            },
            action = 57,
            action_txt = '点击前往',
            repeat_task = {
                cd = 7, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
				{ id =80005, num = 1 },
                { id =12963, num = 1 },
            },

        },
},




{ 
        title = "周年庆福利", 
        id = 30330,
                { 
            id = 50000, 
            title = "开启属于你的迷你时光之旅！", 
            start_time = '2022-03-18 10:00:00', 
            end_time = '2022-03-27 23:59:59', 
            close_time = '2022-03-27 23:59:59', 
            action = 99, 
            action_txt = '立即开启', 
           action_url="s4_https://sso.mini1.cn/#/transit?url=https://h5.mini1.cn/act/c5m/my2021/&portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --apiids_no = '45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 

            { 
            id = 4080, 
            title = "参与周年庆典、长城联动皮肤免费送", 
            start_time = '2022-03-16 10:00:00', 
            end_time = '2022-04-03 23:59:59', 
            close_time = '2022-04-03 23:59:59', 
            hide_red_mark=1,
            action = 103, 
            action_txt = '立即前往', 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.11.0",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 


    },  


{ 
        title = "学做图赢好礼", 
        id = 30382,
                { 
            id = 4292, 
            title = "查看《沙盒建筑速成礼包》介绍，领取好礼", 
            start_time = '2022-03-30 00:00:00', 
            end_time = '2022-03-31 23:59:59', 
            close_time = '2022-03-31 23:59:59', 
            action = 99, 
            action_txt = '点击查看', 
           action_url="https://shop99765053.m.youzan.com/wscgoods/detail/1ybs15n0pzgxh0t?scan=1&activity=none&from=kdt&qr=directgoods_1689790669&shopAutoEnter=1&portrait=1&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids ='1,110,69,65,64,71,74,62,73,72,70,68,67,66,63,75,76,112,113,77,78,81,79',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
},


    {
        title = "周年欢乐会场",
        id = 30370,
         { 
            id = 4242, 
            title = "肉肉姐姐花小楼带你过周年 献上最惊喜的生日礼", 
            start_time = '2022-03-26 10:00:00', 
            end_time = '2021-03-27 22:59:59', 
            close_time = '2021-03-27 22:59:59', 
            action = 99, 
            action_txt = '前往任务', 
            action_url = "https://hd.huya.com/huyaDIYzt/21941/mobile/index.html?openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
                { 
            id = 4247, 
            title = "芒果TV周年分会场——共庆生赢周边大奖", 
            start_time = '2022-03-24 10:00:00', 
            end_time = '2022-03-24 22:59:59', 
            close_time = '2022-03-24 22:59:59', 
            action = 99, 
            action_txt = '点击观看', 
            action_url = "https://d.mgtv.com/zb-vn?channel=yx&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
            { 
            id = 4238, 
            title = "视频号周年分会场——投稿做任务赢京东卡大奖", 
            start_time = '2022-03-23 10:00:00', 
            end_time = '2022-03-26 22:59:59', 
            close_time = '2022-03-26 22:59:59', 
            action = 99, 
            action_txt = '点击参与', 
            action_url = "https://game.weixin.qq.com/cgi-bin/comm/openlink?noticeid=90281690&auth_appid=wx62d9035fd4fd2059&url=https%3A%2F%2Fgame.weixin.qq.com%2Fcgi-bin%2Factnew%2Fnewportalact%2F160466%2FB0f2_-viCq4IHC41YkDKOA%2Fmain_page%3Fact_id%3D160466%26k%3DB0f2_-viCq4IHC41YkDKOA%26pid%3Dmain_page%23wechat_redirect&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 

             { 
            id = 4239, 
            title = "爱奇艺周年分会场——参与活动赢京东卡、皮肤大奖", 
            start_time = '2022-03-23 10:00:00', 
            end_time = '2022-03-23 22:59:59', 
            close_time = '2022-03-23 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://activity.m.iqiyi.com/h5base/act/mnsj6zn.html?openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
        { 
            id = 4240, 
            title = "上抖音参与迷你世界六周年庆典，看直播抽装扮", 
            start_time = '2022-03-25 10:00:00', 
            end_time = '2022-03-25 22:59:59', 
            close_time = '2022-03-25 22:59:59', 
            action = 99, 
            action_txt = '点击观看', 
            action_url = "https://aweme.snssdk.com/magic/eco/runtime/release/623306e1b261cb0383bc85ca?appType=douyin&should_full_screen=1&hide_nav_bar=1&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
        { 
            id = 4241, 
            title = "西瓜视频周年分会场——做活动抽皮肤大奖", 
            start_time = '2022-03-23 10:00:00', 
            end_time = '2022-03-25 22:59:59', 
            close_time = '2022-03-25 22:59:59', 
            action = 99, 
            action_txt = '点击观看', 
            action_url = "https://i.snssdk.com/magic/eco/runtime/release/62397500ad0041035c43eaaf?appType=ixigua&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },

        { 
            id = 4243, 
            title = "花样过迷你年，新春大集赢现金大奖", 
            start_time = '2022-01-30 10:00:00', 
            end_time = '2022-01-31 22:59:59', 
            close_time = '2022-01-31 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://game.weixin.qq.com/cgi-bin/comm/openlink?noticeid=90279503&auth_appid=wx8d08365c0c59884a&url=https%3A%2F%2Fgame.weixin.qq.com%2Fcgi-bin%2Fh5%2Fstatic%2Fwelfare-task-center%2Ftask_detail.html%3Fappid%3Dwxa20b612f1a6b4117%26actid%3D601901%26wechat_pkgid%3Dwelfare_task_center_task_detail%23wechat_redirect&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,21',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
        { 
            id = 4244, 
            title = "爱奇艺游戏春节大狂欢！迷你欢乐过虎年", 
            start_time = '2022-01-31 10:00:00', 
            end_time = '2022-02-04 22:59:59', 
            close_time = '2022-02-04 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://static.iqiyi.com/mp-activity/springgame.html#/?openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,21',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
        { 
            id = 4245, 
            title = "来抖音花式过虎年，秀出欢乐赢大奖！", 
            start_time = '2022-01-31 10:00:00', 
            end_time = '2022-02-03 22:59:59', 
            close_time = '2022-02-03 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://aweme.snssdk.com/magic/eco/runtime/release/61f0e96a54b34b03457dcf80?appType=douyin&title_color=ffffff&nav_bar_color=000000&status_bar_color=000000&magic_source=guanwang&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,21',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
        { 
            id = 4246, 
            title = "虎虎生财！来快手齐开虎年宝箱赢华为电脑、盲盒", 
            start_time = '2022-01-26 10:00:00', 
            end_time = '2022-01-30 22:59:59', 
            close_time = '2022-01-30 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://ppg.m.etoote.com/doodle/HiwDkJxU.html?hyId=doodle_HiwDkJxU&openBrowser=1", 
            hide_red_mark=1,
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,21',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        },
    },   

    {
        title = "萌新创造福利",
        id = 30363,

            { 
            id = 4209, 
            title = "登录7天送永久皮肤“迷小酷”，开通学习卡送专属坐骑“源码螺旋”", 
            start_time = '2022-02-01 10:00:00', 
            end_time = '2022-02-06 22:59:59', 
            close_time = '2022-02-06 22:59:59', 
            action = 99, 
            action_txt = '点击领取', 
            action_url = "https://course.miniaixue.com/activity?id=hanjia2&fromType=1055&utm_source=%E8%BF%B7%E4%BD%A0%E4%B8%96%E7%95%8C&utm_medium=cpm&utm_term=%E7%99%BB%E5%BD%95%E9%80%81%E7%9A%AE%E8%82%A4&utm_content=%E7%99%BB%E5%BD%95%E9%80%81%E7%A8%80%E6%9C%89%E7%9A%AE%E8%82%A4%E8%BF%B7%E5%B0%8F%E9%85%B7&utm_campaign=20220113-%E8%BF%B7%E4%BD%A0%E4%B8%96%E7%95%8C-%E7%A6%8F%E5%88%A9%E6%8E%A8%E8%8D%90-%E6%96%87%E5%AD%97%E9%93%BE-hanjia2-%E5%85%8D%E8%B4%B9%E7%9A%AE%E8%82%A4-1055&_channel_track_key=ahZVOkgr&openBrowser=1&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
			apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,21',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
    },


    {
        title = "周年庆大放价",
        id = 30365,

            { 
            id = 4214, 
            title = "19.9参与抽盒，最高立减225！", 
            start_time = '2022-03-24 10:00:00', 
            end_time = '2022-03-27 22:59:59', 
            close_time = '2022-03-27 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://mall.miniworldstory.com/?portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
			apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5,52',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
    },


    {
        title = "创作者感恩福利",
        id = 30362,

        {
            id = 4208,
            title = "2021年内发布过1张下载量大于等于10的地图",
            start_time = '2022-01-05 00:00:00',
            end_time = '2022-02-08 23:59:59',
            close_time = '2022-02-08 23:59:59',
            conditions = {
                version_min = "1.08.5",
				apiids_no =  "9999",
            },
            task_conditions = {
                creator_download = 1
            },
            gift = {{
                id = 33052,
                num = 1
            }}
        }
    },
{ 
        title = "来自小镇的福利", 
        id = 30334,
                { 
            id = 50007, 
            title = "迷你小镇热闹营业！打工、开店欢乐多多，快来参加吧！", 
            start_time = '2022-05-09 18:00:00', 
            end_time = '2022-05-15 23:59:59', 
            close_time = '2022-05-15 23:59:59', 
            action = 74, 
            action_txt = '前往参加', 
           --action_url="s4_https://sso.mini1.cn/#/transit?url=https://h5.mini1.cn/act/c5m/my2021/&portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            version_min = "1.12.0",
                --apiids_no = '45',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
 },





{
        title = "迷你世界大电影",
        id = 30331,
                { 
            id = 50001,
            title = "做电影任务，赢海量皮肤、新款盲盒", 
            start_time = '2022-04-10 00:00:00', 
            end_time = '2022-04-10 23:59:59', 
            close_time = '2022-04-10 23:59:59', 
            action = 99, 
            action_txt = '点击跳转', 
            action_url = "https://ppg.m.etoote.com/doodle/NbhEqikY.html?hyId=jimu_NbhEqikY&entry_src=callback_android_bm_ba_yxstnryy_nset&openBrowser=1", 
            need_press_action = 1,
            conditions = {
            --apiids_no = '100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, 
                times = 1, 
                max = 1000, 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
               }, 
        },
      },


{
        title = "抽盒福利放送",
        id = 30335,--自定义，现在上线的不重复就行
                { 
            id = 50009, --自定义，历史不重复
            title = "9.9参与抽盒，最高立减225！", 
            start_time = '2022-05-27 00:00:00', 
            end_time = '2022-06-05 23:29:59', 
            close_time = '2022-06-05 23:29:59', --下线时间
            action = 99, --跳转模块
            action_txt = '前往了解', --跳转按钮
            action_url = "s4_https://mall.miniworldstory.com/?portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 ，领取的触发条件
            conditions = {
            apiids_no = '21',
            },
            task_conditions = { --对用户层级的限制，可以设置流失用户等条件领
                login_day = 0, --登录游戏的用户就能领取
            }, 
            repeat_task = { --领取限制
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, --奖励是否叠加，0的意思是今天没有领取第二天登录后还是领取的原始份额奖励，不会叠加。
                 }, 
            gift = { 
                { id = 12851, num = 1 }, ----奖励id
               }, 
        },
      },

 {
        title = "赛事福利",
        id = 30340,--自定义，现在上线的不重复就行      
{ 
            id = 50018, 
            title = "《迷你联萌》周边设计赛开启，投稿赢海量周边好礼！", 
            start_time = '2022-06-23 00:00:00', 
            end_time = '2022-07-03 23:59:59', 
            close_time = '2022-07-03 23:59:59',  
            action = 99, 
            action_txt = '前往投稿', 
            action_url ="s4_https://wss.mini1.cn/category/3/detail/1208/info", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --version_min = "1.04.0",
           --apiids = '1,110',
           apiids_no="21,52,45,53,17,74,13",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12962, num = 1 }, 
            }, 
        }, 
 { 
            id = 50016, 
            title = "投稿赢千元奖金，更有专属头像框和流量扶持！", 
            start_time = '2022-06-16 00:00:00', 
            end_time = '2022-07-03 23:59:59', 
            close_time = '2022-07-03 23:59:59',  
            action = 99, 
            action_txt = '立即投稿', 
            action_url ="s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/1/detail/1206/info&portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --version_min = "1.04.0",
           --apiids = '1,110',
           apiids_no="21,52,45,53,17,74,13",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12963, num = 1 }, 
            }, 
        }, 
 { 
            id = 50017, 
            title = "家园保卫战PVE塔防主题训练营，边学边做，投稿赢大奖！", 
            start_time = '2022-06-17 00:00:00', 
            end_time = '2022-07-10 23:59:59', 
            close_time = '2022-07-10 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url="s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/2/detail/1205/info?portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            --version_min = "1.13.0",
            --apiids_no = '21,52',
            apiids = '1,110',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
   { 
            id = 50002, 
            title = "创作打工模拟主题作品，投稿赢最高万元现金大奖！", 
            start_time = '2022-04-15 14:00:00', 
            end_time = '2022-05-15 23:59:59', 
            close_time = '2022-05-15 23:59:59',  
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/5/detail/1202/info?portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --version_min = "1.04.0",
            apiids = '1,110',
--apiids_no="52,7,12,13,21,36",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12851, num = 1 }, 
            }, 
        }, 
   { 
            id = 50006, 
            title = "使用模板进行二次创作，赢大额迷你币及永久皮肤！", 
            start_time = '2022-05-01 00:00:00', 
            end_time = '2022-05-15 23:59:59', 
            close_time = '2022-05-15 23:59:59',  
            action = 99, 
            action_txt = '前往了解', 
            action_url ="https://kfz.mini1.cn/activities/mbec/#/?portrait=1&from=fuli&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                --version_min = "1.04.0",
           apiids = '1,110',
           --apiids_no="52,21",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id =12851, num = 1 }, 
            }, 
        }, 

            { 
            id = 4128, 
            title = "创作电影觉醒地图，投稿赢现金和周边大奖！", 
            start_time = '2022-03-18 10:00:00', 
            end_time = '2022-04-17 22:59:59', 
            close_time = '2022-04-17 22:59:59', 
            action = 99, 
            action_txt = '前往投稿', 
            action_url = "s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/5/detail/1197/info&portrait=3&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                version_min = "1.04.0",
            apiids_no = '52',
            --apiids ="1,110",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
            { 
            id = 4129, 
            title = "探索宇宙，逐梦九天，创作航天主题作品，共筑航天新时代", 
            start_time = '2022-03-23 10:00:01', 
            end_time = '2022-04-19 22:59:59', 
            close_time = '2022-04-19 22:59:59',  
            action = 99, 
            action_txt = '前往投稿', 
            action_url = "s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/1/detail/1200/info&openBrowser=3&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
            apiids_no = '52',
            --apiids ="1,110",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 

           { 
            id = 4070, 
            title = "创作春节主题作品，一起云拜年！", 
            start_time = '2022-01-17 10:00:00', 
            end_time = '2021-02-27 17:59:59', 
            close_time = '2021-02-27 17:59:59', 
            action = 99, 
            action_txt = '前往投稿', 
            action_url = "s4_https://sso.mini1.cn/ssourl/#/transit?url=https://wss.mini1.cn/category/1/detail/1184/info&openBrowser=3&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '9999,7,5',
                 },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
           { 
            id = 4078, 
            title = "快乐向前冲教学直播第六课：勇闯大转盘", 
            start_time = '2021-11-27 18:00:00', 
            end_time = '2021-11-28 22:59:59', 
            close_time = '2021-11-28 22:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "https://hd.huya.com/huyaDIYzt/19349/mobile/index.html?wxShare=1&openBrowser=1&portrait=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids_no = '109,101,102,122,124,125,121,123,127,126,110,100,128,129,7,5',
                 },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
     }, 




{   
        title = "快手专属福利",   
        id = 30298,   
            { 
            id = 3955, 
            title = "前往官号主页领取四重福利", 
            start_time = '2021-01-01 00:00:00', 
            end_time = '2022-12-31 23:59:59', 
            close_time = '2022-12-31 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "kwai://profile/917007972?openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = { 
               apiids ="57",
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12851, num = 1 }, 
            }, 
        }, 
      },





{
        title = "看视频领奖",
        id = 30009,
        {
            id = 18071601,
            title = "广告商的赞助-观看视频领取",
            start_time = '2017-01-01 00:00:00',
            end_time = '2021-12-31 23:59:59',
            close_time = '2021-12-31 23:59:59',
            conditions = {
                version_max = "0.47.4",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,34,36,39,45,57,58,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                login_day = 0,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 4, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad',
            get_txt = '观看领取',

            gift = {
{ id =12851, num = 1 },
{ id =10000, num = 3 },
            },

            gift_random = {
{
{ id =12963, num = 1 },   --1
{ id =10000, num = 3 },
},
{
{ id =12952, num = 1 },   --2
{ id =10000, num = 3 },
},
{
{ id =12953, num = 1 },   --3
{ id =10000, num = 3 },
},
{
{ id =12964, num = 1 },   --4
{ id =10000, num = 3 },
},
{
{ id =12962, num = 1 },   --5
{ id =10000, num = 3 },
},
            },

        },

        {
            id = 20070101,
            title = "广告商的赞助-看视频领奖",
            start_time = '2017-01-01 00:00:00',
            end_time = '2020-12-31 23:59:59',
            close_time = '2020-12-31 23:59:59',
            conditions = {
                version_min = "0.47.5",
                apiids = '2,3,7,11,12,13,15,18,19,21,28,29,32,34,36,39,45,57,58,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },
            task_conditions = {
                ad_press_cb =15,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 4, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            get_btn_action = 'ad27',
            get_txt = '观看领取',

        },

        {
            id = 3561,
            title = "看广告拿迷你点，兑换专属装扮！",
            start_time = '2017-01-01 00:00:00',
            end_time = '2021-09-17 23:59:59',
            close_time = '2021-09-17 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.45.0",
                apiids = '1,2,3,7,11,12,13,15,18,19,21,28,29,32,34,36,39,45,57,58,62,63,64,65,66,68,69,70,71,72,73,74,75,76,77,78,79,80,82,83,92,93,94,10,49,50,96,999',
            },

            task_conditions = {
                login_day = 0,
            },
            action = 33,
            action_txt = '前往查看',
            repeat_task = {
                cd = 7, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },

            gift = {
{ id =12962, num = 1 },
            },

        },

        {
            id = 18083101,
            title = "迷你世界枪战精英",
            start_time = '2017-01-01 00:00:00',
            end_time = '2021-12-30 23:59:59',
            close_time = '2021-12-30 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                version_min = "0.42.0",
                apiids ="13",
            },
            task_conditions = {
                login_day = 0,
            },
            action = 95,
            action_txt = '查看详情',
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
                gift_add_up = 0, --不叠加
            },
            get_btn_action = 'ad15',
            gift = {
                { id = 10000, num = 2 },
            },
        },

    },


{   
        title = "抽盒机上新啦",   
        id = 30316,   
            { 
            id = 4017, 
            title = "9.9参与抽盒，更多限定皮肤等你来抽！", 
            start_time = '2021-09-04 10:00:00', 
            end_time = '2021-09-05 23:59:59', 
            close_time = '2021-09-05 23:59:59', 
            action = 99, 
            action_txt = '立即前往', 
            action_url = "s4_https://mall.miniworldstory.com/?portrait=1&openBrowser=3", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 
            conditions = {
                apiids = '1,110,69,65,64,71,74,62,73,72,70,68,67,66,63,75,76,112,113,77,78,79',
            },
            task_conditions = { 
                login_day = 0, 
            }, 
            repeat_task = { 
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, 
                 }, 
            gift = { 
                { id = 12963, num = 1 }, 
            }, 
        }, 
      },
{
        title = "五一专享福利",
        id = 30333,--自定义，现在上线的不重复就行
                { 
            id = 50004, --自定义，历史不重复
            title = "假期来快手做任务抽福利领永久皮肤！", 
            start_time = '2022-05-01 18:00:00', 
            end_time = '2022-05-04 23:29:59', 
            close_time = '2022-05-04 23:29:59', --下线时间
            action = 99, --跳转模块
            action_txt = '跳转参加', --跳转按钮
            action_url = "https://ppg.m.etoote.com/doodle/KuhULaUC.html?hyId=jimu_KuhULaUC&entry_src=callback_android_bm_ba_yxstnryy_nset_mini&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 ，领取的触发条件
            conditions = {         apiids_no="52,7,12,13,21,36",
            },
            task_conditions = { --对用户层级的限制，可以设置流失用户等条件领
                login_day = 0, --登录游戏的用户就能领取
            }, 
            repeat_task = { --领取限制
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, --奖励是否叠加，0的意思是今天没有领取第二天登录后还是领取的原始份额奖励，不会叠加。
                 }, 
            gift = { 
                { id = 12851, num = 1 }, ----奖励id
               }, 
        },
{ 
            id = 50005, --自定义，历史不重复
            title = "来小红书分享迷你小镇打工记—赢千元奖励x限定头像框", 
            start_time = '2022-05-02 00:00:00', 
            end_time = '2022-05-02 23:29:59', 
            close_time = '2022-05-02 23:29:59', --下线时间
            action = 99, --跳转模块
            action_txt = '点击参与', --跳转按钮
            action_url = "https://www.xiaohongshu.com/apps/vincent/ditto?id=mnxz&naviHidden=yes&utm_source=social&useNativeChannel=yes&fullscreen=true&source=share&page_instance=2683&instance_id=mnxz&xhsshare=CopyLink&appuid=5ad87f5411be105fe0f1eb09&apptime=165114559&openBrowser=1", 
            need_press_action = 1, --点击前往按钮后，才能领取奖励 ，领取的触发条件
            conditions = {         apiids_no="52,7,12,13,21,36,100,101,121,122,109,199,399,123,124,110,127,126,125,102,410,112,113,128,402,129,116,117,118,114,119,130,131,132",
            },
            task_conditions = { --对用户层级的限制，可以设置流失用户等条件领
                login_day = 0, --登录游戏的用户就能领取
            }, 
            repeat_task = { --领取限制
                cd = 1, --每天一个周期 
                times = 1, --周期内可完成1次 
                max = 1000, --最多领100次 
                gift_add_up = 0, --奖励是否叠加，0的意思是今天没有领取第二天登录后还是领取的原始份额奖励，不会叠加。
                 }, 
            gift = { 
                { id = 12851, num = 1 }, ----奖励id
               }, 
        },
      },

  

{   
        title = "开发者专属福利",   
        id = 30294,   

            { 
            id = 3942, 
            title = "发布1张地图且下载量超过50", 
            start_time = '2021-07-01 10:00:00', 
            end_time = '2021-07-31 23:59:59', 
            close_time = '2021-07-31 23:59:59', 
			action_txt = '发布地图',
            action = 40, 
			action_url = "",
			need_press_action = 0,
            conditions = {
                version_min = "1.1.0",
            },
            task_conditions = { 
               develop_download = 50 ,
            }, 
            gift = { 
                { id = 12948, num = 1}, 
				{ id = 12961, num = 3}, 
				{ id = 12988, num = 3}, 
            	}, 
        	}, 
			{ 
            id = 3943, 
            title = "发布1张商业化地图且下载量超过50", 
            start_time = '2021-07-01 10:00:00', 
            end_time = '2021-07-31 23:59:59', 
            close_time = '2021-07-31 23:59:59', 
			action_txt = '发布地图',
            action = 40, 
			action_url = "",
			need_press_action = 0,
            conditions = {
                version_min = "1.1.0",
            },
            task_conditions = { 
               develop_pay_download = 50,
            }, 
            gift = { 
                { id = 22155, num = 1}, 
            	}, 
        	}, 

			{ 
            id = 3946, 
            title = "发布1个资源且被标记为精品", 
            start_time = '2021-05-26 10:00:00', 
            end_time = '2020-06-30 23:59:59', 
            close_time = '2020-06-30 23:59:59', 
            action = 99, 
			action_url = "s4_https://dev-wiki.mini1.cn/wiki/79.html?id=79",
			need_press_action = 0,
            conditions = {
                version_min = "1.1.0",
            },
            task_conditions = { 
               develop_chosen_download = 1,
            }, 
            gift = { 
                { id = 10003, num = 20 }, 
            	}, 
        	}, 
           
},


     

 {
        title = "QQ版每日福利",
        id = 30197,
        {
            id = 3589,
            title = "邀请QQ好友下载游戏，领取永久精美装扮",
            start_time = '2020-09-07 10:00:00',
            end_time = '2020-09-30 23:59:59',
            close_time = '2020-09-30 23:59:59',
            hide_red_mark=1,
            action = 99,
            action_txt = '立即邀请',
            action_url = "https://youxi.vip.qq.com/m/act/fbefb54c4a_mini1_512040.html?_wv=1&_wwv=4?openBrowser=1",
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
                apiids = '56',
            },
            task_conditions = {
                login_day = 0,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成一次
                max = 100, --最多领100次
                gift_add_up = 0,
            },
            gift = {
                { id = 20035, num = 1 },
            },
        },

        {
            id = 3590,
            title = "每日分享",
            start_time = '2020-01-01 10:00:00',
            end_time = '2021-12-31 23:59:59',
            close_time = '2021-12-31 23:59:59',
            need_press_action = 1, --点击前往按钮后，才能领取奖励
            conditions = {
	            apiids = '56',
            },
            task_conditions = {
                login_day = 0,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成一次
                max = 100, --最多领100次
                gift_add_up = 0,
            },
            action = 93,
            action_txt = "分享",
            gift = {
                { id = 20035, num = 1 },
            },
        },
},







	{
			title = '每日免费礼包',
			id = 2012181431,
			{
            	id = 2012181438,
				pos = 2,	-- 1(缺省即默认)：普通福利，2：福利页签福利，3：装扮页福利
            	title = "子测试1(别动我的啊，动打手)",
				title_x = "子测试(别动我的啊，动打手)",
				title_1 = "子测试(别动我的啊，动打手)",
            	start_time = '2018-01-01 00:00:00',
            	end_time = '2031-01-01 00:00:00',
            	close_time = '2031-01-01 00:00:00',
				cd_day = 1,
				task_conditions = {
					login_day=0
				},
				conditions = {
	                version_min = "0.52.5",
	                --apiids = '1,110,45,999',
				},
				red_day = 1,
				gift_inhomogeneous_random = {
					{id=12963, num=1, probability=0.04},
					{id=12834, num=1, probability=0.12},
					{id=12833, num=1, probability=0.12},
					{id=12962, num=1, probability=0.12},
					{id=12950, num=2, probability=0.12},
					{id=12951, num=2, probability=0.12},
					{id=12952, num=2, probability=0.12},
					{id=12953, num=2, probability=0.12},
					{id=12954, num=2, probability=0.12},
				}
                        },

			{
            	id = 2012181439,
				pos = 3,	-- 1(缺省即默认)：普通福利，2：福利页签福利，3：装扮页福利
            	title = "子测试2(别动我的啊，动打手)",
				title_x = "子测试(别动我的啊，动打手)",
				title_1 = "子测试(别动我的啊，动打手)",
            	start_time = '2018-01-01 00:00:00',
            	end_time = '2031-01-01 00:00:00',
            	close_time = '2031-01-01 00:00:00',
				cd_day = 1,
				task_conditions = {
					login_day=0
				},
				conditions = {
	                version_min = "0.52.5",
	                apiids = '1,110,45,999',
				},
				red_day = 1,
				gift_inhomogeneous_random = {
					{id=12950, num=5, probability=0.3},
					{id=12952, num=5, probability=0.4},
					{id=12953, num=5, probability=0.3},
				}
                        },
	},







   {
        title = "充值福利",
        id = 40000,
        {
            id = 20200317,
            title = "首次充值任意金额，即可领取专属装扮",
            start_time = '2020-09-28 10:00:00',
            end_time = '2022-09-20 23:59:59',
            close_time = '2022-09-23 23:59:59',
            conditions = {
                apiids_no = "9999",
           version_min = "0.53.0",
            },
            task_conditions = {
                recharge_first= 1,
            },
            gift = {
                { id = 22441, num = 1 },
            },
        },
     },


{
        title = "实名认证福利",
        id = 88880000,
        {
            id = 88880001,
            title = "完成实名认证，即可领取定制装扮大礼包",
            start_time = '2018-01-01 00:00:00',
            end_time = '2020-12-31 23:59:59',
            close_time = '2020-12-31 23:59:59',
			action  = 92,
            action_txt = '认证领奖',
            hide = 1,
            conditions = {
                version_min = "0.39.5",
                apiids_no = '63,5,7,52,3,89,11,34',
            },
            task_conditions = {
                real_authed = 1,
            },
            gift = {
                { id = 22106, num = 1 },
                { id = 20032, num = 10 },
                { id = 10000, num = 200 },
            },
			ui_desc = {
				 txt1 = "为保护未成年人身心健康，未满18周岁和未完成实名认证的用户将受到防沉迷系统限制。年满18周岁用户完成实名认证后将不受限制，自由游戏！\n\n用户信息仅用于实名认证，绝对保密！实名信息认证后不可修改，请填写真实信息！\n\n温馨提示：请尽快完善身份信息，未完善身份信息的用户未来可能无法游戏（所有游戏都一样），#cFFA500信息完善后即可获得豪华礼包（含永久定制装扮）！#n\n\n(请勿使用他人身份证进行验证)",
                visitor_txt1 = "亲爱的冒险家，根据国家游戏防沉迷规定，未满18周岁的游戏用户仅能在法定节假日及每周五、周六及周日的20:00～21:00享受游戏服务。",
                visitor_txt2 = "亲爱的冒险家，根据国家游戏防沉迷规定，未满18周岁的游戏用户仅能在法定节假日及每周五、周六及周日的20:00～21:00享受游戏服务。",
				txt2 = "完成实名认证即可领取定制装扮大礼包！",
				switch_acc = 1,    --是否可以切换账号
			},
        },

  		{
            id = 88880002,
            title = "完成华为实名认证，重新登录游戏即可领取奖励",
            start_time = '2018-01-01 00:00:00',
            end_time = '2020-12-31 23:59:59',
            close_time = '2020-12-31 23:59:59',
            hide = 1,
            action = 91,
            action_txt = '认证领奖',
            action_url = "https://activity.mini1.cn/id_verification_notice_huawei/index.html",
            conditions = {
                version_min = "0.40.10",
                apiids = '7',
            },
            task_conditions = {
                hw_auth = 1,
            },
            gift = {
                { id = 21979, num = 1 },
                { id = 20032, num = 30 },
                { id = 10000, num = 200 },

            },

        },

        {
            id = 88880003,
            title = "完成4399实名认证，重新登录游戏即可领取奖励",
            start_time = '2018-01-01 00:00:00',
            end_time = '2020-12-31 23:59:59',
            close_time = '2020-12-31 23:59:59',
            action = 91,
            hide = 1,
            action_txt = '认证领奖',
            conditions = {
                version_min = "0.41.0",
                apiids = '2',
            },
            task_conditions = {
                s399_auth = 1,
            },
            gift = {
                { id = 21979, num = 1 },
                { id = 20032, num = 10 },
                { id = 10000, num = 200 },

            },

        },

        {
            id = 88880004,
            title = "完成4399实名认证，重新登录游戏即可领取奖励",
            start_time = '2018-01-01 00:00:00',
            end_time = '2020-12-31 23:59:59',
            close_time = '2020-12-31 23:59:59',
            action = 99,
            action_txt = '认证领奖',
            action_url = "https://u.4399.com/profile/realname.html?openBrowser=1",
            conditions = {
                version_min = "0.41.1",
                apiids = '121',
            },
            hide = 1,
            task_conditions = {
                s399_auth = 1,
            },
            gift = {
                { id = 21979, num = 1 },
                { id = 20032, num = 10 },
                { id = 10000, num = 200 },

            },
        },
	},


{
        title = "绑定福利",
        id = 50001,
     {
            id = 500011,
            title = "绑定QQ即可领取福利——重新登录领取",
            start_time = '2018-01-01 00:00:00',
            end_time = '2021-12-31 23:59:59',
            close_time = '2021-12-31 23:59:59',
            hide = 1,
            conditions = {
                version_max = "1.01.6",
                apiids = '45,1,110,65,64,71,74,62,73,72,70,68,67,66,63,75,76,112,113,77,78,79',
            },
            task_conditions = {
                qq = 1, --首绑
            },
			action = 17,
			action_txt = "立即绑定",
            gift = {
                { id = 12988, num = 1 },
                { id = 20032, num = 15 },
            },
        },
     {
            id = 500012,
            title = "绑定微信即可领取福利——重新登录领取",
            start_time = '2018-01-01 00:00:00',
            end_time = '2021-12-31 23:59:59',
            close_time = '2021-12-31 23:59:59',
            hide = 1,
            conditions = {
                version_max = "1.01.6",
                apiids = '1,110,65,64,71,74,62,73,72,70,68,67,66,63,75,76,112,113,77,78,79',
            },
            task_conditions = {
                wechat = 1, --首绑
            },
			action = 17,
			action_txt = "立即绑定",
            gift = {
                { id = 12988, num = 1 },
                { id = 20032, num = 15 },
            },
        },
},




  

    {
        title = "新手福利",
        id = 30013,
        {
            id = 2000,
            title = "WeGame专属新手福利",
            hide = 1,
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                apiids = '102', },
            task_conditions = {
                login_day = 1,
            },

            gift = {
                { id = 12963, num = 5 },
                { id = 12964, num = 2 },
                { id = 12998, num = 1 },
                { id = 10000, num = 66 },
            },
        },

    },

    {
        title = "oppo特权礼包",
        id = 30014,
        {
            id = 18012901,
            title = "OPPO游戏中心启动每日福利",
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                apiids = '13,54',

            },
            task_conditions = {
                start_game_out = 13,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
            },

            gift = {
                { id = 12962, num = 1 },
            },

        },


        {
            id = 3234,
			start_game_out_extra = 13,
            title = "OPPO游戏中心启动周二登录奖励",
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                apiids = '13,54',

            },
				start_game_out_extra = 13,
            task_conditions = {
                week_day = 2,
            },

            repeat_task = {
                cd = 4, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
            },
            gift = {
                { id = 12963, num = 1 },
            },
        },


    },


    {
        title = "vivo特权礼包",
        id = 30015,
        {
            id = 18012902,
            title = "vivo游戏中心启动每日福利",
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                version_min = "0.23.0",
                apiids = '36',

            },
            task_conditions = {
                start_game_out = 36,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
            },
            gift = {
                { id = 12851, num = 1 },
                { id = 12962, num = 1 },
                { id = 12963, num = 1 },
            },

        },
    },


    {
        title = "应用宝特权礼包",
        id = 3001501,
        {
            id = 19052101,
            title = "应用宝每日福利",
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                version_min = "0.35.5",
                apiids = '21',

            },
            task_conditions = {
                start_game_out = 21,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
            },
            gift = {
                { id = 12851, num = 1 },
                { id = 12962, num = 1 },
                { id = 12963, num = 1 },
            },

        },
    },

    {
        title = "小米特权礼包",
        id = 3001502,
        {
            id = 19071001,
            title = "小米每日福利",
            start_time = '2018-01-01 00:00:00',
            end_time = '2022-12-31 23:59:59',
            close_time = '2022-12-31 23:59:59',
            conditions = {
                version_min = "0.35.5",
                apiids = '12',

            },
            task_conditions = {
                start_game_out = 12,
            },
            repeat_task = {
                cd = 1, --每天一个周期
                times = 1, --周期内可完成1次
                max = 1000, --最多领100次
            },
            gift = {
                { id = 12851, num = 1 },
            },

        },
    },


--------------------------------------------------------------------------------------------------

 baoku = {
        -- 货币种类
        -- '10003':迷你宝盒
        -- '10004':玉兔勋章
		-- '10017':迷你袜子
		-- '10018':迷你铃铛
		-- '10019':迷你金蛋    

[1] = { 
       id = 1675353600,              -- 固定10位长度数字 
        apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
       version_min = "0.52.0",       --最小版本限制 
            start_time = '2023-02-03 00:00:00',
            end_time = '2023-02-09 23:59:59',
            close_time = '2023-02-09 23:59:59',
       coin = 10019,                                
       url = { 
              action = 101, --action:是跳转内部还是外部 
                }, 
       title  = "金蛋福利宝库",     
       txt1 = "时间：2月3日-2月9日", 
       txt2 = "完成任务收集迷你金蛋奖励道具，就可以免费兑换你喜爱的道具啦~\n温馨提示：1.定制装扮请重登游戏使用。\n2.本次收集的“迷你金蛋”将在活动结束后清零，请及时兑换哦！",         
       goods = { 
    [1] = {price = 600, limit = 1, focus = 1, itemId = 21909, num = 1},   
    [2] = {price = 600, limit = 1, focus = 1, itemId =22281, num = 1}, 
    [3] = {price = 400, limit = 1, focus = 1, itemId = 21770, num = 1}, 
    [4] = {price = 300,  limit = 1,focus = 1, itemId = 22161, num = 1}, 
    [5] = {price = 300,  limit = 1,focus = 1, itemId = 21874, num = 1}, 
    [6] = {price = 300,  limit = 1, focus = 1, itemId =22255, num = 1}, 
    [7] = {price = 300,  limit = 1,focus = 1, itemId = 21817, num = 1}, 
    [8] = {price = 300,  limit = 1, focus = 1, itemId = 21747, num = 1}, 
    [13] = {price = 20,  limit = 20,focus = 0, itemId = 12964, num =2},
    [14] = {price = 20,  limit = 20,focus = 0, itemId = 12963, num = 2},
    [15] = {price = 20,  limit = 20,focus = 0, itemId = 12851, num = 2},
    [16] = {price = 20,  limit = 20,focus = 0, itemId = 12833, num = 2},
            }, 
        },

[2] = { 
       id = 1675958400,              -- 固定10位长度数字 
        apiids = '1,2,3,7,11,12,13,15,18,21,28,29,32,33,34,36,39,45,55,56,58,60,62,63,64,65,66,68,69,70,71,72,73,74,75,76,78,79,80,82,83,91,92,93,94,10,49,50,96,999',
       version_min = "0.52.0",       --最小版本限制 
            start_time = '2023-02-10 00:00:00',
            end_time = '2023-02-16 23:59:59',
            close_time = '2023-02-16 23:59:59',
       coin = 10018,                                
       url = { 
              action = 101, --action:是跳转内部还是外部 
                }, 
       title  = "铃铛宝库",     
       txt1 = "时间：2月10日-2月16日", 
       txt2 = "完成任务收集迷你铃铛奖励道具，就可以免费兑换你喜爱的道具啦~\n温馨提示：1.定制装扮请重登游戏使用。\n2.本次收集的“迷你铃铛”将在活动结束后清零，请及时兑换哦！",         
       goods = { 
    [1] = {price = 600, limit = 1, focus = 1, itemId = 22133, num = 1},   
    [2] = {price = 600, limit = 1, focus = 1, itemId =22208, num = 1}, 
    [3] = {price = 400, limit = 1, focus = 1, itemId = 22310, num = 1}, 
    [4] = {price = 300,  limit = 1,focus = 1, itemId = 21805, num = 1}, 
    [5] = {price = 300,  limit = 1,focus = 1, itemId = 21740, num = 1}, 
    [6] = {price = 300,  limit = 1, focus = 1, itemId =22246, num = 1}, 
    [7] = {price = 300,  limit = 1,focus = 1, itemId = 21925, num = 1}, 
    [8] = {price = 300,  limit = 1, focus = 1, itemId = 22003, num = 1}, 
    [13] = {price = 20,  limit = 20,focus = 0, itemId = 12964, num =2},
    [14] = {price = 20,  limit = 20,focus = 0, itemId = 845, num = 2},
    [15] = {price = 20,  limit = 20,focus = 0, itemId = 20035, num = 2},
    [16] = {price = 20,  limit = 20,focus = 0, itemId = 24803, num = 2},
            }, 
        },

},

-- 周末好礼配置
weekend_gift = {
    -- 活动时间
    start_time = '2021-07-01 10:00:00',
    end_time = '2099-11-31 23:59:59',

    -- 抽奖时间（这里只配置从几点到几点可抽奖，周五、周六、周日在代码判断）
    rotate_start = '20:00',
    rotate_end = '21:00',

    -- 指定后端时间：1970-01-01 00:00:00，如果是空的或者不配置，则不生效
    -- test_offset_time = '2021-11-12 18:00:00',

    -- 订阅奖励，随机抽取
    -- 如果设置了rotate_once=1，则只会抽中一次
    subscribe_award = {
        [1] = {itemId = 12948, num = 1},
        [2] = {itemId = 24810, num = 15},
        [3] = {itemId = 24807, num = 15},
        [4] = {itemId = 20038, num = 10},
        [5] = {itemId = 20315, num = 1, rotate_once = 1},
    },

    -- 登录奖励
    login_award = {
        -- 一等奖
        [1] = {
            [1] = {itemId = 12965, num = 1},
            [2] = {itemId = 10025, num = 1},
        },
        -- 二等奖
        [2] = {
            [1] = {itemId = 845, num = 1},
            [2] = {itemId = 1055, num = 1},
            [3] = {itemId = 12961, num = 1},
        },
        -- 三等奖
        [3] = {
            [1] = {itemId = 12851, num = 1},
            [2] = {itemId = 12988, num = 1},
            [3] = {itemId = 12960, num = 3},
        },
    },

    -- 登录奖励概率
    login_award_ratio = {
        -- 第一次抽奖
        [1] = {
            [1] = 0,        -- 一等奖概率
            [2] = 50,       -- 二等奖概率
            [3] = 50,       -- 三等奖概率
        },
        -- 第二次抽奖
        [2] = {
            [1] = 70,       -- 一等奖概率
            [2] = 20,       -- 二等奖概率
            [3] = 10,       -- 三等奖概率
        }
    },

    -- 邮件配置
    mail = {
        send = 1,           -- 发送开关：1 打开，其他关闭，注意：邮件是否发送也受活动时间控制
        send_time = "18:00",  -- 几点几分发送
        send_weekday = 5,   -- 周几发送：1-7，分别对应周一到周日

        title = "周末限时好礼",
        content = "每周五、周六、周日的晚上8点-9点均有好礼等你来开启，设置日历提醒还可每周抽取限定皮肤碎片，达奇、铃音等精美皮肤等你来拿！点击下方【跳转】按钮，即可前往领取。",
        jump_to = 48,       -- 跳转落地页id
    },
   
},

    -- 周末好礼V2配置
    weekend_gift_v2 = {
        -- 活动时间
        start_time = '2022-04-19 10:00:00',
        end_time = '2029-04-13 14:40:00',

        -- 抽奖时间（这里只配置从几点到几点可抽奖，周五、周六、周日在代码判断）
        rotate_start = '00:00',
        rotate_end = '23:59',

        -- 指定后端时间：1970-01-01 00:00:00，如果是空的或者不配置，则不生效
        -- test_offset_time = '',

        -- 订阅奖励
        subscribe_award = {
            -- 1级宝箱
            [1] = {
                [1] = {
                    itemId = 12965,
                    num = 1,
                    weight = 10,        -- 概率权重
                },
                [2] = {
                    itemId = 1055,
                    num = 1,
                    weight = 10,        -- 概率权重
                },
                [3] = {
                    itemId = 12960,
                    num = 3,
                    weight = 10,        -- 概率权重
                },
            },
            --2级宝箱
            [2] = {
                [1] = {
                    itemId = 12988,
                    num = 3,
                    weight = 10,        -- 概率权重
                },
                [2] = {
                    itemId = 12948,
                    num = 1,
                    weight = 10,        -- 概率权重
                },
                [3] = {
                    itemId = 20038,
                    num = 30,
                    weight = 10,        -- 概率权重
                },
            },
            --3级宝箱
            [3] = {
                [1] = {
                    itemId = 24803,
                    num = 15,
                    weight = 10,        -- 概率权重
                },
                [2] = {
                    itemId = 24807,
                    num = 15,
                    weight = 10,        -- 概率权重
                },
                [3] = {
                    itemId = 24821,
                    num = 15,
                    weight = 10,        -- 概率权重
                },
            },
        },

        -- 消息推送
        push = {
            send = 1, -- 发送开关：1 打开，其他关闭，注意：邮件是否发送也受活动时间控制
            send_time = "12:00", -- 几点几分发送
            send_weekday = 5, -- 周几发送：1-7，分别对应周一到周日
            prepare_min = 120, -- 提前多少分钟告诉平台准备mobpush发送
        }
    },


    -- 每日签到配置
    daily_sign = {
        -- 活动时间
        start_time = '2021-07-01 10:00:00',
        end_time = '2099-11-31 23:59:59',

        -- 拍脸开关(1表示对低活用户拍脸，0表示不拍脸)
        notice_control = 1;

        -- 后端时间（用于测试，如果是空的或者不配置，则不生效）
        test_offset_time = '',

        -- ABTest，不配或者置空则关闭ABTest
        ABTest = "",

        -- 成年补签配置
        adult_sign = {
            sign_card_count = 4,            -- 补签次数
            sign_cost_bean = {              -- 补签消耗迷你豆
                [1] = 10,
                [2] = 10,
                [3] = 10,
                [4] = 10,
                [5] = 10,
                [6] = 10,
                [7] = 10,
            }
        },

        -- 未成年补签配置
        under_age_sign = {
            sign_card_count = 5,            -- 补签次数
            sign_cost_bean = {              -- 补签消耗迷你豆
                [1] = 10,
                [2] = 10,
                [3] = 10,
                [4] = 10,
                [5] = 10,
                [6] = 10,
                [7] = 10,
            }
        },

        -- 签到奖励
        sign_award = {
            [1] = {id = 10000, num = 30, name = "迷你豆"},      -- 周一奖励
            [2] = {id = 12964, num = 1, name = "传送卷轴"},     -- 周二奖励
            [3] = {id = 12851, num = 1, name = "欢乐礼包"},    -- 周三奖励
            [4] = {id = 12834, num = 1, name = "昼夜烟花"},     -- 周四奖励
            [5] = {id = 10000, num = 20, name = "迷你豆"},      -- 周五奖励
            [6] = {id = 845, num = 1, name = "保密箱"},         -- 周六奖励
            [7] = {id = 12988, num = 3, name = "装扮体验礼包"}, -- 周日奖励
        },
    },

    -- 年度评选
    annual_selection = {
        -- begin
        ["2021年度作品"] = {8096606588692,99050668994084,99050668994084,9642478448758,5541002425757,26783715805524,76013402532369,18795936138215,56780419756648,62261162331994,70107025668742,43787257756145,20577502368192,7709875337271,26294283713825,69759215849042,90211558865446,33828093280405,6494247644706,54207744266794,34669840198362,42206644241251,89280443679424,82708268389821,15823153026770,9290291130486,1224318872962,23339094362516,38285487791430,31194426716076,22776520407157,22909958206216,43436186949151,31903982742419,50393345319489,85654533353823,8513030376303,49148493875326,43801259169311,78491258863056,36975522766150,2547060675258,49552093839839,6313642545065,40110715054765,16906072100890,60938021163445,5476875702202,57029369222851,71421667214100,74149045532340,19079342504341,74166226795984,49225826814832,22256612902879,53786946779413,14870130141910,67156838774452,60907956392373,5816624032945,38504531123526,14844563647111,65684015594255,10694873762671,51874620270362,7585106110871,61006740232085,58258133800487,38174887779888,65859512852393,8843444302170,59979437870659,97212597612539,25533916176537,65717966086147,39702953693107,85809354607414,73190940113814,82300420906786,30472870809109,43221120041008,26380641235560,20135965934567,26882205574938,16339272003793,89160297438983,28455183095701,41812596493874,49152631519701,30916140264339,91887628106761,49616661802606,24387152847332,24095237662891,37749075035335,39544752134308,3015205925266,5167616530682,41089967598253,22926929131042
}
        -- end
    },

-- 端外加好友
    outside_addfriend = {
		-- begin
		apiids  = '21,36',--渠道限制  '999,1,2,3'
		onoff = 1,--总开关   0:关闭,1:开启   
		share_text_prefix = "复制好友令，打开迷你世界加我为好友：",
		friendbtn_onoff = 1,  --好友界面左下角开关   0:关闭,1:开启
		-- end
    },
	-- 新手社交
	newbie_social = {
		onoff = 1,--总开关   0:关闭,1:开启  
		show_guide_delay = 8, -- 新手引导后延迟时间
	},
-- 在线好友推荐地图
	recommendonlinefriend = {
		onoff = 1,--总开关   0:关闭,1:开启,
		abtest = 1, -- ab开关， 1开启ab, 0关闭，全量
		tipsSec = 5, -- 拒绝按钮倒计时
	},
---------------------------------------------------------------------------------------------------------

};

