{
    "msgsys_other": {},
    "msgsys_info": {
        "0": {
            "5": {
                "name": "邮件",
                "sort": 1,
                "hide": 1
            },
            "1": {
                "name": "官方邮件",
                "sort": 1,
                "hide": 0
            },
            "2": {
                "name": "好友邮件",
                "sort": 2,
                "hide": 0
            },
            "3": {
                "name": "系统消息",
                "sort": 2,
                "hide": 1
            },
            "20001": {
                "name": "开发者消息",
                "sort": 1,
                "hide": 1
            },
            "20002": {
                "name": "系统消息",
                "sort": 2,
                "hide": 0
            },
            "20003": {
                "name": "运营活动",
                "sort": 3,
                "hide": 1
            },
            "4": {
                "name": "互动消息",
                "sort": 3,
                "hide": 0
            },
            "10002": {
                "name": "点赞我的",
                "sort": 1,
                "hide": 1
            },
            "10001": {
                "name": "评论我的",
                "sort": 2,
                "hide": 1
            },
            "10004": {
                "name": "@我的",
                "sort": 3,
                "hide": 1
            },
            "10003": {
                "name": "评论置顶",
                "sort": 4,
                "hide": 1
            }
        }
    },
    "msgsys_tree": {
        "0": {
            "id": 5,
            "channels": {
                "0": 1,
                "1": 2
            }
        },
        "1": {
            "id": 3,
            "channels": {
                "0": 20001,
                "1": 20002,
                "2": 20003
            }
        },
        "2": {
            "id": 4,
            "channels": {
                "0": 10002,
                "1": 10001,
                "2": 10004,
                "3": 10003
            }
        }
    }
}